{"books":[{"title":"'Salem's Lot Illustrated Edition","date":"November 2005","text":" 'Salem's Lot Illustrated EditionFormats: HardcoverFirst Edition Release Date:November, 2005Synopsis:Author Ben Mears returns to ‘Salem's Lot to write a book about a house that has haunted him since childhood only to find his isolated hometown infested with vampires. While the vampires claim more victims, Mears convinces a small group of believers to combat the undead.Notes:Includes a new Introduction by Stephen, photographs by Jerry Uelsmann, and in the back of the book includes pages that were omitted from the original publication, and the short stories One for the Road and Jerusalem's Lot. ","image":"http://stephenking.com/images/novel/55/hardcover_illo_prop_embed.jpg","id":0},{"title":"'Salem's Lot","date":"October 2004","text":" 'Salem's LotFormats: Formats: Deluxe Slipcased Gift EditionFirst Edition Release Date: 2015Synopsis:Special Features For This Deluxe Special Edition:• an introduction by Stephen King• an afterword by Clive Barker• many deleted scenes that were cut from the original manuscript• the short stories “Jerusalem’s Lot” and “One for the Road”• deluxe oversized design (7 inches X 10 inches) featuring two color interior printing as part of the page design• printed on a heavy interior specialty paper stock that is much thicker than the paper in a normal trade edition• epic wrap-around full color dust jacket artwork by David Palumbo• a different full color dust jacket for the Numbered Artist Edition painted by David Palumbo• full color interior paintings by David Palumbo• interior artwork will be printed on a heavy glossy stock and tipped into the book• an original map of the town drawn by Glenn Chadbourne exclusively for this special edition• signature sheet artwork for all three editions by Glenn Chadbourne• high-quality endpapers and fine bindings• an exclusive reproduction of the first reader’s letter to point out the Father “Cody” error and several internal memos from Doubleday about changing the pricing after the first edition of the book was already printed• extremely collectible print run that is a tiny fraction of the TENS OF MILLIONS of copies of this novel you’ve seen in bookstores over the years! ","image":"http://stephenking.com/images/limited_edition/salems-lot/salems_lot_dse_prop_embed.png","id":1},{"title":"'Salem's Lot","date":"December 2014","text":" 'Salem's LotFormats: Formats: Deluxe Slipcased Gift EditionFirst Edition Release Date: 2015Synopsis:Special Features For This Deluxe Special Edition:• an introduction by Stephen King• an afterword by Clive Barker• many deleted scenes that were cut from the original manuscript• the short stories “Jerusalem’s Lot” and “One for the Road”• deluxe oversized design (7 inches X 10 inches) featuring two color interior printing as part of the page design• printed on a heavy interior specialty paper stock that is much thicker than the paper in a normal trade edition• epic wrap-around full color dust jacket artwork by David Palumbo• a different full color dust jacket for the Numbered Artist Edition painted by David Palumbo• full color interior paintings by David Palumbo• interior artwork will be printed on a heavy glossy stock and tipped into the book• an original map of the town drawn by Glenn Chadbourne exclusively for this special edition• signature sheet artwork for all three editions by Glenn Chadbourne• high-quality endpapers and fine bindings• an exclusive reproduction of the first reader’s letter to point out the Father “Cody” error and several internal memos from Doubleday about changing the pricing after the first edition of the book was already printed• extremely collectible print run that is a tiny fraction of the TENS OF MILLIONS of copies of this novel you’ve seen in bookstores over the years! ","image":"http://stephenking.com/images/limited_edition/salems-lot/salems_lot_dse_prop_embed.png","id":2},{"title":"'Salem's Lot","date":"October 1975","text":" 'Salem's LotFormats: Hardcover / Paperback / Trade / Limited Edition / Audio / KindleFirst Edition Release Date:October, 1975Synopsis:Author Ben Mears returns to ‘Salem's Lot to write a book about a house that has haunted him since childhood only to find his isolated hometown infested with vampires. While the vampires claim more victims, Mears convinces a small group of believers to combat the undead. ","image":"http://stephenking.com/images/books/salems_lot/hardcover_prop_embed.jpg","id":3},{"title":"11/22/63","date":"November 2011","text":" 11/22/63Formats: HardcoverFirst Edition Release Date:November, 2011Synopsis:Jake Epping is a thirty-five-year-old high school English teacher in Lisbon Falls, Maine, who makes extra money teaching adults in the GED program. He receives an essay from one of the students—a gruesome, harrowing first person story about the night 50 years ago when Harry Dunning’s father came home and killed his mother, his sister, and his brother with a hammer. Harry escaped with a smashed leg, as evidenced by his crooked walk.Not much later, Jake’s friend Al, who runs the local diner, divulges a secret: his storeroom is a portal to 1958. He enlists Jake on an insane—and insanely possible—mission to try to prevent the Kennedy assassination. So begins Jake’s new life as George Amberson and his new world of Elvis and JFK, of big American cars and sock hops, of a troubled loner named Lee Harvey Oswald and a beautiful high school librarian named Sadie Dunhill, who becomes the love of Jake’s life—a life that transgresses all the normal rules of time.Notes:Visit the 11/22/63 Promo PageVisit the 11/22/63 Audio and Video Page ","image":"http://stephenking.com/images/books/11-22-63/11-22-63_prop_embed.jpg","id":4},{"title":"1408","date":"March 2002","text":" 1408Synopsis:Mike Enslin, bestselling author of \"true\" ghost stories, decides to spend the night in New York City's most haunted hotel room. But he must live to write about it without the help of his ex best-friends, his trusty smokes. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":5},{"title":"1922","date":"November 2010","text":" 1922Synopsis:The story opens with the confession of Wilfred James to the murder of his wife, Arlette, following their move to Hemingford, Nebraska onto land willed to Arlette by her father. ","image":"http://stephenking.com/images/books/full_dark_no_stars/full_dark_no_stars_prop_embed.jpg","id":6},{"title":"The 21st Pan Book of Horror Stories","date":"December 1979","text":" The 21st Pan Book of Horror StoriesFormats: PaperbackFirst Edition Release Date:1980Edited By:Herbert Van ThalSynopsis:Contains \"Graveyard Shift\" and \"The Mangler\" ","image":"http://stephenking.com/images/anthology/58/pan_book_of_horrors.jpg","id":7},{"title":"35 Scary Years with Stephen King","date":"March 2009","text":" 35 Scary Years with Stephen KingSynopsis:Interview regarding Stephen's career ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":8},{"title":"A Book of Horrors","date":"September 2011","text":" A Book of HorrorsFormats: Hardcover / Trade PaperbackFirst Edition Release Date:September, 2011Edited By:Stephen JonesSynopsis:A collection of original horror and dark fantasy from the world's best writers, including Stephen King and John Ajvide Lindqvist. Contains Stephen's short story, \"The Little Green God of Agony\". ","image":"http://stephenking.com/images/anthology/70/a_book_of_horrors.jpg","id":9},{"title":"A Conversation with Stephen King","date":"December 2003","text":" A Conversation with Stephen KingSynopsis:Print interview with Stephen King by Tony Magistrale focusing on film adaptations ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":10},{"title":"A Death","date":"November 2015","text":" A DeathSynopsis:“A Death,” is about the murder of a young girl and the man suspected of killing her. Set in the Black Hills of Dakota shortly before the territory enters the United States in 1889, the story opens with Jim Trusdale’s arrest.\"A Death\" is available in the March 9th, 2015 issue of The New Yorker. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":11},{"title":"A Face in the Crowd","date":"December 1999","text":" A Face in the CrowdSynopsis:Dean Evers, an elderly widower, sits in front of the television with nothing better to do than waste his leftover evenings watching baseball. It’s Rays/Mariners, and David Price is breezing through the line-up. Suddenly, in a seat a few rows up beyond the batter, Evers sees the face of someone from decades past, someone who shouldn’t be at the ballgame, shouldn’t be on the planet. And so begins a parade of people from Evers’s past, all of them occupying that seat behind home plate. Until one day Dean Evers sees someone even eerier...Coming August 21, 2012 ","image":"http://stephenking.com/images/books/face_in_the_crowd/property_embed.jpg","id":12},{"title":"A Fantasy Reader: The Seventh World Fantasy Convention Book","date":"October 1981","text":" A Fantasy Reader: The Seventh World Fantasy Convention BookFormats: HardcoverFirst Edition Release Date:October, 1981Edited By:Jeff Frane and Jack RemsSynopsis:The Bird and the Album (This is an excerpt from then unpublished novel IT which was distributed as a souvenir book of the convention.) ","image":"http://stephenking.com/images/anthology/24/7th_world_fantasy_convention.jpg","id":13},{"title":"A Good Marriage","date":"November 2010","text":" A Good MarriageSynopsis:Darcy Anderson learns more about her husband of over twenty years than she would have liked to know when she stumbles literally upon a box under a worktable in their garage. ","image":"http://stephenking.com/images/books/full_dark_no_stars/full_dark_no_stars_prop_embed.jpg","id":14},{"title":"A New Introduction to John Fowles's The Collector","date":"December 1999","text":" A New Introduction to John Fowles's The CollectorSynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":15},{"title":"A Night at the Royal Festival Hall: Muriel Gray Interviews Stephen King","date":"December 1999","text":" A Night at the Royal Festival Hall: Muriel Gray Interviews Stephen KingSynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":16},{"title":"A Very Tight Place","date":"November 2008","text":" A Very Tight PlaceSynopsis:Thinking that he is meeting for a resolution of an on-going legal dispute, Curtis Johnson is lured to a deserted construction site by his neighbor, Tim Grunwald, whose electric fences caused the death of Johnson’s beloved dog Betsy. The meeting does not go as either Johnson or Grunwald had hoped. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":17},{"title":"A Very Tight Place","date":"December 1999","text":" A Very Tight PlaceSynopsis:Curtis Johnson is lured to a deserted construction site by his neighbor, Tim Grunwald, with whom he's been having a legal dispute involving Curtis's beloved dog. He is confronted by Grunwald who forces him into a Port-O-Sans and leaves him trapped there in the heat of a Florida summer day. With no way to get help, Curtis must figure out how to escape or die. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":18},{"title":"Afterlife","date":"November 2015","text":" AfterlifeSynopsis:William Andrews, an investment banker with Goldman Sachs, dies on September 23, 2012, and finds himself confronted with his life after death.Afterlife was published in theSummer 2013 issue (#56) of Tin House Magazine. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":19},{"title":"All That You Love Will Be Carried Away","date":"March 2002","text":" All That You Love Will Be Carried AwaySynopsis:A man checks into a Lincoln Nebraska Motel 6 to find the meaning in his life. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":20},{"title":"An Evening at the Billerica (Massachusetts) Library","date":"December 1999","text":" An Evening at the Billerica (Massachusetts) LibrarySynopsis:This is a transcript of a reading Stephen gave. ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":21},{"title":"An Evening with Stephen King","date":"December 1999","text":" An Evening with Stephen KingSynopsis:This is a transcript of one of Stephen's speeches. ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":22},{"title":"An International Treasury of Mystery and Suspense","date":"October 1983","text":" An International Treasury of Mystery and SuspenseFormats: HardcoverFirst Edition Release Date:October, 1983Edited By:Marie R. RenoSynopsis:A selection of thrillers and whodunits includes tales by such masters as Christie, King, Hammett, James, Fleming, Sayers, Gordimer, Stout, Waugh, Simenon, and others.Contains the short story \"Strawberry Spring\". ","image":"http://stephenking.com/images/anthology/27/intl_treasury_of_mystery__suspense.jpg","id":23},{"title":"Antaeus No. 75/76 The Final Issue","date":"October 1994","text":" Antaeus No. 75/76 The Final IssueFormats: HardcoverFirst Edition Release Date:October, 1994Edited By:Daniel HalpernSynopsis:Final issue of the legendary literary journal. Featuring new work by Stephen King (Blind Willie), Nadine Gordimer, Joyce Carol Oates, Edward Gorey (Serious Life). Also, excerpts from the pre-election notebook of Bill Clinton, an open letter from Paul Bowles, the unpublished opening of The Sun Also Rises, fiction and poetry by most of the notable writers of our time.   ","image":"http://stephenking.com/images/anthology/5/antaeusno.75.jpg","id":24},{"title":"Apt Pupil","date":"August 1982","text":" Apt PupilSynopsis:A golden California schoolboy and an old man whose hideous past he uncovers enter into a fateful and chilling mutual parasitism. ","image":"http://stephenking.com/images/books/different_seasons/hardcover_prop_embed.jpg","id":25},{"title":"Arbor House Celebrity Book of Horror Stories","date":"December 1981","text":" Arbor House Celebrity Book of Horror StoriesFormats: HardcoverFirst Edition Release Date:1982Edited By:Charles G. Waugh & Martin H. GreenbergSynopsis:Collection of 20 stories, each introduced by different celebritiesContains short story \"The Crate\". ","image":"http://stephenking.com/images/anthology/6/celebbookofhorror.jpg","id":26},{"title":"Arbor House Necropolis","date":"October 1981","text":" Arbor House NecropolisFormats: HardcoverFirst Edition Release Date:October, 1981Edited By:Bill PronziniSynopsis:This book collects two previously published horror anthologies on Voodoo and Mummies, along with a new section collecting stories on the subject of Ghouls. Pronzini introduces each of the 3 sections with a concise essay on the subject along with a primer on the literature of each. Additional introductory matter accompanies each story and includes authors in addition to King such as Poe, Tennessee Williams, Robert Bloch et al.Contains short story \"Gray Matter\" in Ghoul section. ","image":"http://stephenking.com/images/anthology/7/arborhousenecropolis.jpg","id":27},{"title":"Arbor House Treasury of Horror & the Supernatural","date":"December 1980","text":" Arbor House Treasury of Horror & the SupernaturalFormats: PaperbackFirst Edition Release Date:1981Edited By:Bill Pronzini, Barry N. Malzburg & Martin H. GreenburgSynopsis:Includes Introduction and story, The Crate, by King ","image":"http://stephenking.com/images/anthology/8/arborhousetreasury.jpg","id":28},{"title":"The Art of Fiction No. 189","date":"December 2005","text":" The Art of Fiction No. 189Synopsis:Print interview with Stephen published in The Paris Review, Fall 2006, and reprinted in The Paris Review Interviews, Vol. II ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":29},{"title":"Authors@aol series","date":"September 1998","text":" Authors@aol seriesSynopsis:Q&A  interview aired through AOL sponsored by Barnes & Noble ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":30},{"title":"Autopsy Room Four","date":"March 2002","text":" Autopsy Room FourSynopsis:The last thing Howard Cottrell remembers is entering the woods to find his golf ball. He wakes up as he is being rolled into an autopsy room, but is completely paralyzed and unable to let the attendants know he is still alive. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":31},{"title":"Ayana","date":"November 2008","text":" AyanaSynopsis:A man's father is dying of pancreatic cancer. A strange little girl named Ayana arrives at his hospital room and gives him a kiss--but not a \"kiss of death.\" Instead his father miraculously recovers. The narrator must repay this miracle, though, and over the years is called upon to do so. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":32},{"title":"The Bachman Books","date":"October 1985","text":" The Bachman BooksFormats: HardcoverFirst Edition Release Date:October, 1985Synopsis:Omnibus collection of four early Bachman novels (Rage, The Long Walk, Roadwork, The Running Man) and the essay \"Why I Was Bachman\"Notes:There will be no future printings of this book at Stephen's request due to the sensitive nature of the material found in Rage. ","image":"http://stephenking.com/images/bachman_novel/7/hardcover_prop_embed.jpg","id":33},{"title":"Bad Little Kid","date":"November 2015","text":" Bad Little KidSynopsis:The story is about a man, George Hallas, whose life is changed forever when he realizes that a mysterious boy is causing the deaths of people he loves. It is told as he is in prison explaining how he ended up there to his attorney, Leonard Bradley. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":34},{"title":"Bag of Bones","date":"September 1998","text":" Bag of BonesFormats: Hardcover / Paperback / Audio / eBook / KindleFirst Edition Release Date:September, 1998Synopsis:Several years after his wife's death, novelist Mike Noonan still suffers writer's block. A dream inspires him to return to the couple's summer retreat in western Maine, a lakeside house called Sara Laughs. Shortly after arriving, Noonan is caught in the middle of a custody battle involving the daughter of an attractive young widow and the child's enormously wealthy grandfather. He also discovers that Sara Laughs is haunted and that his late wife, Joanna, still has something to tell him. ","image":"http://stephenking.com/images/books/bag_of_bones/hardcover_prop_embed.jpg","id":35},{"title":"The Ballad of the Flexible Bullet","date":"June 1985","text":" The Ballad of the Flexible BulletSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":36},{"title":"Banned Books and Other Concerns: The Virginia Beach Lecture","date":"December 1999","text":" Banned Books and Other Concerns: The Virginia Beach LectureSynopsis:This is a transcript of a speech given by Stephen at the Virginia Beach Public Library in Virginia Beach, VA. ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":37},{"title":"Batman and Robin Have An Altercation","date":"November 2015","text":" Batman and Robin Have An AltercationSynopsis:A middle-aged man named Sanderson brings his Alzheimer's-afflicted father to Applebee's for their weekly lunch, where for three years they have ordered the same food and had the same conversation. Just as Sanderson despairs of finding any shred of the man who raised him, he’s saved from a brutal assault to find his father wielding a weapon procured in a moment of lucidity.  ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":38},{"title":"Battleground","date":"December 1977","text":" BattlegroundSynopsis:A professional hit man find himself the subject of an attack in retaliation for his recent murder of a toymaker. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":39},{"title":"The Bazaar of Bad Dreams","date":"November 2015","text":" The Bazaar of Bad DreamsFormats: HardcoverFirst Edition Release Date:November, 2015Synopsis:Table of Contents:Author’s noteIntroduction1. Mile 81 – Scribner e. 2. Premium Harmony – 2009 New Yorker 3. Batman and Robin Have an Altercation – Harpers 2012 4. The Dune – Granta 2011 5. Bad Little Kid – New; Serial 6. A Death 7. The Bone Church – poem 8. Morality – Esquire 2009 9. Afterlife – Tin House 2013 10. Ur – 2009 Amazon e. 11. Herman Wouk is Still Alive – The Atlantic 2011 12. Under the Weather – Mass Market FDNS 13. Blockade Billy – Scribner e. 14. Mister Yummy – New; Serial 15. Tommy – Playboy poetry 16. The Little Green God of Agony – A Book of Horrors 2011 17. That Bus is Another World - Esquire 18. Obits – New; Serial 19. Drunken Fireworks 20. Summer Thunder – Cemetery Dance 2013-----Stephen delivers a generous collection of stories, several of them brand-new, featuring revelatory autobiographical comments on when, why, and how he came to write (or rewrite) each story.Magnificent, eerie, utterly compelling, these stories comprise one of Stephen's finest gifts to the constant reader—“I made them especially for you,” says King. “Feel free to examine them, but please be careful. The best of them have teeth.”View the Cover Artwork (Large)View the Animated Cover Artwork   ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":40},{"title":"Beachworld","date":"June 1985","text":" BeachworldSynopsis:The two surviving members of a spacecraft’s crash find themselves on an uncharted planet made up entirely of sand which they remark as being similar to a beach. The planet’s mystery is revealed when a second spacecraft arrives to rescue them. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":41},{"title":"Before the Play","date":"December 1999","text":" Before the PlaySynopsis:This story tells of events which occurred before the Torrance family arrived at the Overlook Hotel. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":42},{"title":"Best American Sports Writing, 1991","date":"December 1990","text":" Best American Sports Writing, 1991Formats: PaperbackFirst Edition Release Date:1991Edited By:David Halberstam & Glenn StoutSynopsis:The Best American series is the premier annual showcase for the country's finest short fiction and nonfiction. Each volume's series editor selects notable works from hundreds of magazines, journals, and websites. A special guest editor, a leading writer in the field, then chooses the best twenty or so pieces to publish. This unique system has made the Best American series the most respected-and most popular-of its kind. A superb collection. The Best American Sports Writing 1991 captures the majesty, humor, tragedy, and ultimate humanity found in the games we play.Contains non-fiction essay \"Head Down\". ","image":"http://stephenking.com/images/anthology/9/bestamericansports.jpg","id":43},{"title":"The Best Book You Can't Read","date":"December 1999","text":" The Best Book You Can't ReadSynopsis:Article about Ron McLarty's bookThe Memory of Runningand commenting on publishers' unwillingness to publish worthy books by new authors.First published in King's Entertainment Weekly column and later reprinted in December 2003/January 2004 issue of AudioFile ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":44},{"title":"Best Detective Stories of the Year","date":"December 1978","text":" Best Detective Stories of the YearFormats: HardcoverFirst Edition Release Date:1979Edited By:Edward D. HochSynopsis:Annual collection of detective stories written by various authors.Contains short story \"Quitter's Inc.\" ","image":"http://stephenking.com/images/anthology/10/best_detective_stories_1979.jpg","id":45},{"title":"The Best Science Fiction and Fantasy of the Year","date":"December 2008","text":" The Best Science Fiction and Fantasy of the YearFormats: PaperbackFirst Edition Release Date:2009Edited By:Jonathan StrahanSynopsis:The depth and breadth of what science fiction and fantasy fiction is changes with every passing year. The two dozen stories chosen for this book by award-winning anthologist Jonathan Strahan carefully maps this evolution, giving readers a captivating and always-entertaining look at the very best the genre has to offer.Jonathan Strahan has edited more than twenty anthologies and collections, including The Locus Awards, The New Space Opera, The Jack Vance Treasury, and a number of year's best annuals. He has won the Ditmar, William J. Atheling Jr., and Peter McNamara Awards for his work as an anthologist, and is the reviews editor for Locus.Contains short story \"The New York Timesat Special Bargain Rates\". ","image":"http://stephenking.com/images/anthology/61/best_sf__fantasy_vol_3039.jpg","id":46},{"title":"Big Driver","date":"November 2010","text":" Big DriverSynopsis:Mystery writer, Tess, has been supplementing her writing income for years by doing speaking engagements with no problems. But following a last-minute invitation to a book club 60 miles away, she takes a shortcut home with dire consequences. ","image":"http://stephenking.com/images/books/full_dark_no_stars/full_dark_no_stars_prop_embed.jpg","id":47},{"title":"Big Wheels: A Tale of the Laundry Game (Milkman #2)","date":"June 1985","text":" Big Wheels: A Tale of the Laundry Game (Milkman #2)Synopsis:Following a night of heavy drinking, laundry workers Rocky and Leo are on their way home when they see a vehicle--possibly a milk truck--ominously following them on a long, dark stretch of road. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":48},{"title":"Black House","date":"December 2001","text":" Black HouseFormats: Formats: HardcoverFirst Edition Release Date: 2002Synopsis:\"Deluxe\" limited edition of 1,520 numbered copies, with traycase, signed by King, Straub, and BerryGift edition of 3,500 copies, unsigned, slipcased with a new gift edition ofThe Talisman(also limited to 3,500 copies), signed by Straub & Berry only     ","image":"http://stephenking.com/images/limited_edition/34/le_hardcover_prop_embed.jpg","id":49},{"title":"Black House","date":"September 2001","text":" Black HouseFormats: Hardcover / Paperback / Limited Edition / Audio / KindleFirst Edition Release Date:September, 2001Synopsis:In this sequel to The Talisman, Jack Sawyer is now in his late thirties and has taken early retirement from the LAPD, retreating to a small town in Wisconsin. He has no memory of his adventures as a twelve-year-old boy, when he traveled into a parallel universe in search of the talisman that would save his mother's life. A series of murders involving young children force him out of retirement. There is more to these cases than murder, though, and Jack must retrieve his childhood memories to rescue the latest victim, who is coveted by the killer's evil overlord, a powerful force from End-World, in Roland the gunslinger's universe.    ","image":"http://stephenking.com/images/books/black_house/hardcover_prop_embed.jpg","id":50},{"title":"The Blackboard Jungle","date":"December 1983","text":" The Blackboard JungleFormats: HardcoverFirst Edition Release Date:1984Edited By:Evan HunterSynopsis:Introduction by King ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":51},{"title":"Blaze","date":"December 2006","text":" BlazeFormats: HardcoverFirst Edition Release Date:2007Synopsis:Clayton Blaisdell, Jr., a/k/a Blaze, has had a hard life which led him to petty criminal activities. Even though his partner, George Rackley, died three months before, Blaze is still hearing his instructions for pulling off one more scheme--the kidnapping of an infant whose parents are millionaires. The story tells of the attachment Blaze forms for baby Joe as he remembers his own childhood--one that was much different than the one baby Joe will have. ","image":"http://stephenking.com/images/books/blaze/hardcover_prop_embed.jpg","id":52},{"title":"Blind Willie","date":"October 1994","text":" Blind WillieSynopsis:First published in the limited edition,Six Stories,this story tells of a man who pretends to be blind and makes his living panhandling on the streets of New York. In the past, bribing the police has kept him from being arrested but he has finally met one who may not take money for an answer.Edited for its inclusion inHearts in Atlantis, the story is expanded to explain that Blind Willie was one of the boys who tormented Bobby Garfield and his friends Carol and \"Sully\" from \"Low Men in Yellow Coats.\" ","image":"http://stephenking.com/images/books/hearts_in_atlantis/hardcover_prop_embed.jpg","id":53},{"title":"Blockade Billy","date":"December 2009","text":" Blockade BillyFormats: Formats: Trade Hardcover / Deluxe Signed LimitedFirst Edition Release Date: 2010Synopsis:Even the most diehard baseball fans don't know the true story of William \"Blockade Billy\" Blakely.He may have been the greatest player the game has ever seen, but today no one remembers his name. He was the first — and only — player to have his existence completely removed from the record books. Even his team is long forgotten, barely a footnote in the game's history.Every effort was made to erase any evidence that William Blakely played professional baseball, and with good reason. Blockade Billy had a secret darker than any pill or injection that might cause a scandal in sports today. His secret was much, much worse... and only Stephen King, the most gifted storyteller of our age, can reveal the truth to the world, once and for all.About the Artists:Glen Orbik has been a freelance illustrator and drawing instructor for over twenty years. He studied with master illustrator and classic movie poster artist Fred Fixler, eventually taking over many of Fixler’s classes upon his retirement. Specializing primarily in covers for paperbacks and comics, Glen has painted for clients including Marvel and DC Comics, Sony, TSR, Blizzard Entertainment, Berkley Books and Avon Books (including two Ray Bradbury titles). He has also painted collectible imagery for Warner Bros./DC Studios, as well as preliminary poster work for theSpider-Man and Hulkmovies.Alex McVey is an award-winning, Chesley-nominated illustrator whose work has been published internationally, ranging from album art to graphic design to book illustration. He has illustrated the works of Stephen King, Joe R. Lansdale, Gahan Wilson, Brian Keene, Ramsey Campbell, and Richard Matheson, among others. His clients include ad firms, gaming companies, film studios, bands, and book and magazine publishers. ","image":"http://stephenking.com/images/limited_edition/blockade_billy/blockade_billy_prop_embed.jpg","id":54},{"title":"Blockade Billy","date":"November 2015","text":" Blockade BillySynopsis:William \"Blockade Billy\" Blakely may have been the greatest baseball player the game has ever seen, but today no one remembers his name. He was the first--and only--player to have his existence completely removed from the record books. Every effort was made to erase any evidence William Blakely played professional baseball, and with good reason. Blockade Billy had a secret darker than any pill or injection that might cause a scandal in sports today. His secret was much, much worse. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":55},{"title":"The Body","date":"August 1982","text":" The BodySynopsis:Four rambunctious young boys venture into the Maine woods and in sunlight and thunder find life, death, and intimations of their own mortality. ","image":"http://stephenking.com/images/books/different_seasons/hardcover_prop_embed.jpg","id":56},{"title":"The Bone Church","date":"November 2015","text":" The Bone ChurchSynopsis:\"The Bone Church\" narrative poem was first published in the November 2009 issue ofPlayboy. The poem was illustrated by Phil Hale, and is about an ill-fated jungle expedition. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":57},{"title":"The Boogeyman","date":"December 1977","text":" The BoogeymanSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":58},{"title":"The Book of Lists #3","date":"January 1983","text":" The Book of Lists #3Formats: HardcoverFirst Edition Release Date:January, 1983Edited By:Wallace, Wallace, WallechinskySynopsis:Includes \"Stephen King's 10 Favorite Horror Books or Short Stories\" ","image":"http://stephenking.com/images/anthology/13/book_of_lists.jpg","id":59},{"title":"The Book of the Dead","date":"December 1988","text":" The Book of the DeadFormats: HardcoverFirst Edition Release Date:1989Edited By:John Skipp & Craig SpectorSynopsis:From the dust jacket:George Romero's Night of the Living Dead is one of the most highly regarded films ever made. His own sequels to that modern classic have also been held in high regard by critics and audiences alike. In this volume, many of today's most irreverent and visionary writers of horror fiction revisit Romero's world of the Undead implacably hellbent on cannibalizing living people. The results are exciting, surprising, disturbing, and utterly orginal. Both a homage and an opportunity, these 16 stories pull no punches, and hold back nothing. Recommended for mature adult readers only, many of the themes developed in this anthology feature explicit sexual details and graphic violence on a scale rarely encountered anywhere in any form. Necrophilia is a relatively passe concept by comparison to the material herin. Be warned: this is not for the young or the squeamish. Rest assured, there is literary merit in all this nasty titllation and gore, all this unvarnished exploitation and unchecked perversion. These stories are the products of artists reflecting the unacknowledged base lusts that drive society. This book will do more than entertain; it will inform; it will edify; it will provide useful advice in the event the dead actually do renege.Contains the short story \"Home Delivery\" ","image":"http://stephenking.com/images/anthology/12/bookofthedead.jpg","id":60},{"title":"The Book-Banners: Adventure in Censorship is Stranger Than Fiction","date":"December 1999","text":" The Book-Banners: Adventure in Censorship is Stranger Than FictionSynopsis:Published as a Guest Column in the March 20, 1992 issue of The Bangor Daily News\"When I came into my office last Thursday afternoon, my desk was covered with those little pink message slips that are the prime mode of communication around my place. Maine Public Broadcasting had called, also Channel 2, the Associated Press, and even the Boston Globe. It seems the book-banners had been at it again, this time in Florida. They had pulled two of my books, \"The Dead Zone\" and \"The Tommyknockers,\" from the middle-school library shelves and were considering making them limited-access items in the high school library. What that means is that you can take the book out if you bring a note from your mom or your dad saying it's OK.My news-media callers all wanted the same thing -- a comment. Since this was not the first time one or more of my books had been banned in a public school (nor the 15th), I simply gathered the pink slips up, tossed them in the wastebasket, and went about my day's work. The only thought that crossed my mind was one strongly tinged with gratitude: There are places in the world where the powers that be ban the author as well as the author's works when the subject matter or mode of expression displeases said powers. Look at Salman Rushdie, now living under a death sentence, or Alexander Solzhenitsyn, who spent eight years in a prison camp for calling Josef Stalin \"the boss\" and had to run for the west to avoid another stay after he won the Nobel Prize for \"The Gulag Archipelago.\"When the news stories about my latest adventure in censorship came out, however, I didn't like the way that \"the author could not be reached for comment\" stuff looked. To me, that line has always called up images of swindlers too cowardly to face up to what they've done. In this case I haven't done anything but my job, and I know it's all too possible to make a career out of defending one's fiction -- for a while in the mid-1980s, Judy Blume almostdidmake a career out of it -- but I still didn't like the way it felt.So, just for the record, here is what I'd say if I still took time out from doing my work to defend it.First, to the kids: There are people in your home town who have taken certain books off the shelves of your school library. Do not argue with them; do not protest; do not organize or attend rallies to have the books put back on their shelves. Don't waste your time or your energy. Instead, hustle down to your public library, where these frightened people's reach must fall short in a democracy, or to your local bookstore, and get a copy of what has been banned. Read it carefully and discover what it is your elders don't want you to know. In many cases you'll finish the banned book in question wondering what all the fuss was about. In others, however, you will find vital information about the human condition. It doesn't hurt to remember that John Steinbeck, J.D. Salinger, and even Mark Twain have been banned in this country's public schools over the last 20 years.Second, to the parents in these towns: There are people out there who are deciding what your kids can read, and they don't care what you think because they are positive their ideas of what's proper and what's not are better, clearer than your own. Do you believe they are? Think carefully before you decide to accord the book-banners this right of cancellation, and remember that they don't believe in democracy but rather in a kind of intellectual autocracy. If they are left to their own devices, a great deal of good literature may soon disappear from the shelves of school libraries simply because good books -- books that make us think and feel -- always generate controversy.If you are not careful and diligent about defending the right of your children to read, there won't be much left, especially at the junior-high level where kids really begin to develop a lively life of the mind, but books about heroic boys who come off the bench to hit home runs in the bottom of the ninth and shy girls with good personalities who finally get that big prom date with the boy of their dreams. Is this what you want for your kids, keeping in mind that controversy and surprise -- sometimes even shock -- are often the whetstone on which young minds are sharpened?Third, to the other interested citizens of these towns: Please remember that book-banning is censorship, and that censorship in a free society is always a serious matter -- even when it happens in a junior high, it is serious. A proposal to ban a book should always be given the gravest consideration. Book-banners, after all, insist that the entire community should see things their way, and only their way. When a book is banned, a whole set of thoughts is locked behind the assertion that there is only one valid set of values, one valid set of beliefs, one valid perception of the world. It's a scary idea, especially in a society which has been built on the ideas of free choice and free thought.Do I think that all books and all ideas should be allowed in school libraries? I do not. Schools are, after all, a \"managed\" marketplace. Books like \"Fanny Hill\" and Brett Easton Ellis' gruesome \"American Psycho\" have a right to be read by people who want to read them, but they don't belong in the libraries of tax-supported American middle schools. Do I think that I have an obligation to fly down to Florida and argue thatmybooks, which are a long way from either \"Fanny Hill\" or \"American Psycho,\" be replaced on the shelves from which they have been taken? No. My job is writing stories, and if I spent all my time defending the ones I've written already, I'd have no time to write new ones.Do I believe a defense should be mounted? Yes. If there's one American belief I hold above all others, it's that those who would set themselves up in judgment on matters of what is \"right\" and what is \"best\" should be given no rest; that they should have to defend their behavior most stringently. No book, record, or film should be banned without a full airing of the issues. As a nation, we've been through too many fights to preserve our rights of free thought to let them go just because some prude with a highlighter doesn't approve of them.\" ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":61},{"title":"Borderlands 5","date":"December 2002","text":" Borderlands 5Formats: HardcoverFirst Edition Release Date:2003Edited By:Elizabeth E. Monteleone & Thomas F. MonteleoneSynopsis:First publication of \"Stationary Bike\" ","image":"http://stephenking.com/images/anthology/39/borderlands_5.jpg","id":62},{"title":"The Breathing Method","date":"August 1982","text":" The Breathing MethodSynopsis:A tale told in a strange club about a woman determined to give birth no matter what. ","image":"http://stephenking.com/images/books/different_seasons/hardcover_prop_embed.jpg","id":63},{"title":"Brooklyn August","date":"October 1993","text":" Brooklyn AugustSynopsis:“Brooklyn August” takes a nostalgic look back on the glory days of professional baseball. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":64},{"title":"Cain Rose Up","date":"June 1985","text":" Cain Rose UpSynopsis:Suffering from depression, college student, Curt Garrish, goes on a murderous sniper rampage from his dormitory room. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":65},{"title":"Carrie","date":"April 1974","text":" CarrieFormats: Hardcover / Paperback / Audio / KindleFirst Edition Release Date:April, 1974Synopsis:The story of misfit high-school girl, Carrie White, who gradually discovers that she has telekinetic powers. Repressed by a domineering, ultra-religious mother and tormented by her peers at school, her efforts to fit in lead to a dramatic confrontation during the senior prom.  ","image":"http://stephenking.com/images/books/carrie/hardcover_prop_embed.jpg","id":66},{"title":"Carrie","date":"December 2013","text":" CarrieFormats: Formats: Deluxe Slipcased Gift EditionFirst Edition Release Date: 2014Synopsis: ","image":"http://stephenking.com/images/limited_edition/carrie/carrie_dse_prop_embed.jpg","id":67},{"title":"The Cat from Hell","date":"December 1977","text":" The Cat from HellSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":68},{"title":"Cell","date":"January 2006","text":" CellFormats: Hardcover / Paperback / Audio / eBook / KindleFirst Edition Release Date:January, 2006Synopsis:Artist Clayton Riddell had been in Boston negotiating a successful deal to sell his comic book project.  His joy at finally hitting it big is shattered by an event called The Pulse which causes all those who were using their cell phones at the time of The Pulse to become zombies attacking and killing anyone in their way.  Fortunately for Clay, he does not own a cell phone.  In the panic to get out of Boston and find his way home to his wife and son in Maine, he is joined by Tom McCourt, a man he meets in the meleé immediately following The Pulse and a young girl, Alice, who they rescue from being killed by one of the “crazies.”  The story follows their terrifying journey, avoiding capture—and worse—by the “crazies” who are beginning to “flock” and are led by one they call Raggedy Man as they attempt to reach Maine and a place called Kashwak which they hope will be their salvation.  ","image":"http://stephenking.com/images/books/cell/hardcover_prop_embed.jpg","id":69},{"title":"The Century's Best Horror Fiction Volume Two","date":"December 2010","text":" The Century's Best Horror Fiction Volume TwoFormats: HardcoverFirst Edition Release Date:2011Edited By:John PelanSynopsis:Cemetery Dance Publications commissioned a spectacular two-volume anthology project under the editorship of noted author and historian of the horror genre, John Pelan.John selected one story published during each year of the 20th Century (1901-2000) as the most notable story of that year — all 100 stories were then collected in this amazing two volume set to be published asThe Century's Best Horror Fiction.The ground rules were simple: Only one selection per author. Only one selection per year.Two huge volumes, one hundred authors, one hundred classic stories,more than 700,000 words of fiction— history in the making!Contains the short story \"The Reach\". ","image":"http://stephenking.com/images/anthology/72/centurys_best_horror_fiction_vol.jpg","id":70},{"title":"Chattery Teeth","date":"October 1993","text":" Chattery TeethSynopsis:Salesman Bill Hogan notices an unusual pair of metal teeth in a convenience store and the store’s clerk claims they are broken and gives them to him. Little does Hogan know that not only do the teeth work, but they will save his life when a hitchhiker tries to kill him. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":71},{"title":"Children of the Corn","date":"December 1977","text":" Children of the CornSynopsis:Burt and Vicky are traveling through Nebraska on their way to California on a vacation meant to save their failing marriage. After being involved in an accident in which they run over a young boy who ran into the road, they take the body to Gaitlin, a small isolated community nearby. The story centers on their encounters with the strange citizens of Gaitlin and the entity they call “He Who Walks Behind the Rows”. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":72},{"title":"Christine","date":"December 1982","text":" ChristineFormats: Formats: HardcoverFirst Edition Release Date: 1983Synopsis:1,000 numbered copies with dust jacket and slipcase. Signed by King and artist Stephen Gervais.26 lettered (A-Z) copies with dust jacket and slipcase. Signed by King and artist Stephen Gervais. Not originally intended for sale.There are also an indeterminate number of copies designated \"Publisher's Copy, \" \"Author's Copy,\" and \"Artist's Copy.\" ","image":"http://stephenking.com/images/limited_edition/9/christinelimited.jpg","id":73},{"title":"Christine","date":"April 1983","text":" ChristineFormats: Hardcover / PaperbackFirst Edition Release Date:April, 1983Synopsis:A love triangle involving 17-year-old misfit Arnie Cunningham, his new girlfriend and a haunted 1958 Plymouth Fury. Dubbed Christine by her previous owner, Arnie's first car is jealous, possessive and deadly.  ","image":"http://stephenking.com/images/books/christine/hardcover_prop_embed.jpg","id":74},{"title":"The Chronicles of Harris Burdick","date":"October 2012","text":" The Chronicles of Harris BurdickFormats: HardcoverFirst Edition Release Date:October, 2012Edited By:Synopsis:This anthology containsThe House on Maple Street by Stephen King (formerly published in Nightmares and Dreamscapes) as well as Archie Smith, Boy Wonderby Tabitha King.---An inspired collection of short stories by an all-star cast of best-selling storytellers based on the thought-provoking illustrations in Chris Van Allsburg’s The Mysteries of Harris Burdick. For more than twenty-five years, the illustrations in the extraordinary Mysteries of Harris Burdick by Chris Van Allsburg have intrigued and entertained readers of all ages. Thousands of children have been inspired to weave their own stories to go with these enigmatic pictures. Now we’ve asked some of our very best storytellers to spin the tales. Enter The Chronicles of Harris Burdick to gather this incredible compendium of stories: mysterious, funny, creepy, poignant, these are tales you won’t soon forget. This inspired collection of short stories features many remarkable, best-selling authors in the worlds of both adult and children's literature: Sherman Alexie, M.T. Anderson, Kate DiCamillo, Cory Doctorow, Jules Feiffer, Stephen King, Tabitha King, Lois Lowry, Gregory Maguire, Walter Dean Myers, Linda Sue Park, Louis Sachar, Jon Scieszka, Lemony Snicket, and Chris Van Allsburg himself.Van Allsburg's Harris Burdick illustrations have evoked such wonderment and imagination since Harris Burdick's original publication in 1984; many have speculated or have woven their own stories to go with his images. More than ever, the illustrations send off their eerie call for text and continue to compel and pick at the reader's brain for a backstory—a threaded tale behind the image. In this book, we've collected some of the best storytellers to spin them. ","image":"http://stephenking.com/images/anthology/chronicles_of_harris_burdick/house_on_maple_street/house_on_maple_street_property_embed.jpg","id":75},{"title":"The Color of Evil (Dark Descent)","date":"December 1990","text":" The Color of Evil (Dark Descent)Formats: HardcoverFirst Edition Release Date:1991Edited By:Synopsis:Collection of short stories by various authors including Ray Bradbury; Stephen King; Russell Kirk; H. P. Lovecraft;Shirley Jackson & others.Contains the short story \"The Reach\". ","image":"http://stephenking.com/images/anthology/14/the_dark_descent.jpg","id":76},{"title":"The Colorado Kid (Chadbourne)","date":"December 2006","text":" The Colorado Kid (Chadbourne)Formats: Formats: HardcoverFirst Edition Release Date: 2007Synopsis:Gilt-edged, Leatherbound Hardcover in traycase, 99 copies, signed by the author and all 3 artistsHardcover in slipcase, 450 copies total, signed by the author and the artist (150 by each artist available for purchase)Hardcover, 1,000 copies total, signed by the artist only (333 by each artist available for purchase)Hardcover, 10,000 copies total (3,333 by each artist available for purchase) ","image":"http://stephenking.com/images/limited_edition/43/colorado_kid_chadbourne.jpg","id":77},{"title":"The Colorado Kid (Miller)","date":"December 2006","text":" The Colorado Kid (Miller)Formats: Formats: HardcoverFirst Edition Release Date: 2007Synopsis:Gilt-edged, Leatherbound Hardcover in traycase, 99 copies, signed by the author and all 3 artistsHardcover in slipcase, 450 copies total, signed by the author and the artist (150 by each artist available for purchase)Hardcover, 1,000 copies total, signed by the artist only (333 by each artist available for purchase)Hardcover, 10,000 copies total (3,333 by each artist available for purchase) ","image":"http://stephenking.com/images/limited_edition/41/colorado_kid_miller.jpg","id":78},{"title":"The Colorado Kid (Potter)","date":"December 2006","text":" The Colorado Kid (Potter)Formats: Formats: HardcoverFirst Edition Release Date: 2007Synopsis:Gilt-edged, Leatherbound Hardcover in traycase, 99 copies, signed by the author and all 3 artistsHardcover in slipcase, 450 copies total, signed by the author and the artist (150 by each artist available for purchase)Hardcover, 1,000 copies total, signed by the artist only (333 by each artist available for purchase)Hardcover, 10,000 copies total (3,333 by each artist available for purchase) ","image":"http://stephenking.com/images/limited_edition/42/colorado_kid_potter.jpg","id":79},{"title":"The Colorado Kid","date":"October 2005","text":" The Colorado KidFormats: Paperback / Limited Edition / eBook / Kindle / AudioFirst Edition Release Date:October, 2005Synopsis:Vince Teague and Dave Bowie are the sole operators ofThe Weekly Islander, a small Maine newspaper.  Stephanie McCann has been working for them as an intern.   When Stephanie asks if they've ever come across a real unexplained mystery in the fifty years they'd been publishing the paper, they tell her the story of The Colorado Kid.  ","image":"http://stephenking.comhttp://www.stephenking.com/images/books/colorado_kid/paperback_prop_embed.jpg","id":80},{"title":"The Complete Masters of Darkness","date":"December 1989","text":" The Complete Masters of DarknessFormats: HardcoverFirst Edition Release Date:1990Edited By:Dennis EtchisonSynopsis:A collection of forty-five tales of horror selected by their authors includes stories by Stephen King, Ray Bradbury, Clive Barker, Dean R. Koontz, Whitley Streiber, L. Sprague de Camp, Rod Serling, and others.Contains the short story \"The Woman in the Room\". ","image":"http://stephenking.com/images/anthology/15/mastersofdarkness.jpg","id":81},{"title":"Contemporary Maine Fiction","date":"December 2004","text":" Contemporary Maine FictionFormats: HardcoverFirst Edition Release Date:2005Edited By:Wesley McNairSynopsis:Contains reprint of \"The Reach\" ","image":"http://stephenking.com/images/anthology/45/contemporary_me_fiction034.jpg","id":82},{"title":"Cookie Jar","date":"December 1999","text":" Cookie JarSynopsis:Barrett (Rhett) Alderson’s thirteen year old great-grandson, Dale, has come to visit him at the Good Life Retirement Home where Rhett lives to interview him for a school project. Instead of telling Dale what life was like when Rhett was thirteen—the topic for the interview—Rhett tells him about his mother who had committed suicide after suffering with mental illness for many years when he was eleven and her cookie jar which he inherited. After her death, Rhett and his brother Jack discover it is no ordinary cookie jar. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":83},{"title":"The Crate","date":"December 1980","text":" The CrateSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/anthology/8/arborhousetreasury.jpg","id":84},{"title":"Crouch End","date":"December 1979","text":" Crouch EndSynopsis:Police officers Farnham and Vetter are working the night shift and are discussing the case of Doris Freeman, a young woman who came in to report the disappearance of her husband. Nearly hysterical, Doris’s story involves monsters and other supernatural incidents. Farnham dismisses the story as rubbish, but Vetter, who has worked in Crouch End for years, is not so sure. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":85},{"title":"Cujo","date":"September 1981","text":" CujoFormats: Formats: HardcoverFirst Edition Release Date: September, 1981Synopsis:750numbered copies, with acetate cover and slipcase, signed by Stephen26lettered (A-Z) copies, with acetate cover and slipcase, signed by Stephen. These copies were not originally intended for sale to the public. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":86},{"title":"Cujo","date":"September 1981","text":" CujoFormats: Hardcover / Paperback / Movie / DVDFirst Edition Release Date:September, 1981Synopsis:The Cambers' once-friendly St. Bernard turns into a killer after being bitten by a rabid bat. Donna Trenton's husband is in New York trying to contain a disastrous ad campaign. Feeling abandoned by her workaholic husband, who is frequently out of town, Donna Trenton embarks on an affair with a local handyman. Left to fend for herself, she takes her ailing Pinto to Joe Cambers' garage for repairs only to be trapped with her son Tad in the sweltering car by the monstrous dog. ","image":"http://stephenking.com/images/books/cujo/hardcover_prop_embed.jpg","id":87},{"title":"Cults: An Anthology of Secret Societies, Sects and the Supernatural","date":"November 1983","text":" Cults: An Anthology of Secret Societies, Sects and the SupernaturalFormats: HardcoverFirst Edition Release Date:November, 1983Edited By:Martin H. Greenberg and Charles G.WaughSynopsis:Stories by Frank Harris, H.G. Wells, Edward D. Hoch, Stephen King, John Varley and othersContains short story \"Children of the Corn\". ","image":"http://stephenking.com/images/anthology/16/cults.jpg","id":88},{"title":"Cycle of the Werewolf","date":"December 1982","text":" Cycle of the WerewolfFormats: Formats: HardcoverFirst Edition Release Date: 1983Synopsis:\"Collector's Edition\" of 100 copies (numbered from 1-100), with dust jacket and slipcase, and with a piece of original artwork by Berni Wrightson laid-in. Signed by Stephen King and Berni Wrightson.\"Deluxe Edition\" of 250 copies (numbered from 101-350), with dust jacket and slipcase, and with a portfolio of Berni Wrightson's artwork. Signed by Stephen King and Berni Wrightson.Presentation state of 8 copies, with hand written limitation notice, signed by King and Wrightson, designated \"Artist's Copies.\"Limited trade edtiion of 7,500 copies, unsigned. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":89},{"title":"Cycle of the Werewolf","date":"April 1985","text":" Cycle of the WerewolfFormats: Trade Paperback / Limited Edition / Movie / DVDFirst Edition Release Date:April, 1985Synopsis:A werewolf is stalking Tarker's Mills and only young, wheelchair-bound Marty Coslaw suspects the truth. He enlists the help of his black sheep uncle to identify the shape shifter and destroy him.Notes:First published in 1983 as a limited edition hardcover by The Land of Enchantment. ","image":"http://stephenking.comhttp://www.stephenking.com/images/books/cycle_of_the_werewolf/hardcover_prop_embed.jpg","id":90},{"title":"Danse Macabre","date":"December 1980","text":" Danse MacabreFormats: Formats: HardcoverFirst Edition Release Date: 1981Synopsis:15 lettered (A-O copies) slipcased with glassine paper cover, signed by Stephen. Originally intended for private distribution only 250 numbered copies, slipcased with glassine paper cover, signed by Stephen35 unsigned \"publisher's state\" copies, with slipcase ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":91},{"title":"Danse Macabre","date":"December 1980","text":" Danse MacabreFormats: Hardcover / Paperback / CD / Limited EditionFirst Edition Release Date:1981Synopsis:This is a non-fiction study of the horror genre including books, movies, television, etc. ","image":"http://stephenking.com/images/books/danse_macabre/danse_macabre_prop_embed.jpg","id":92},{"title":"Dark Descent","date":"October 1987","text":" Dark DescentFormats: HardcoverFirst Edition Release Date:October, 1987Edited By:David G. HartwellSynopsis:Includes The Reach, The Monkey, and Crouch End ","image":"http://stephenking.com/images/anthology/3/darkdescenthardcover.jpg","id":93},{"title":"Dark Forces","date":"December 1979","text":" Dark ForcesFormats: HardcoverFirst Edition Release Date:1980Edited By:Kirby McCauleySynopsis:Contributors in addition to King include Isaac Bashevis Singer, Davis Grubb, Ray Bradbury, Russell Kirk, Joyce Carol Oates, Robert BlochContains short story \"The Mist\". ","image":"http://stephenking.com/images/anthology/17/darkforces.jpg","id":94},{"title":"The Dark Half","date":"November 1989","text":" The Dark HalfFormats: Hardcover / Paperback / Movie / DVDFirst Edition Release Date:November, 1989Synopsis:For years, Thad Beaumont has been writing books under the pseudonym George Stark. When a journalist threatens to expose Beaumont's pen name, the author decides to go public first, killing off his pseudonym. Stark isn't content to be dispatched that easily, though. Beaumont's alter ego comes to life and begins to stalk those responsible for his demise. The police suspect Beaumont is responsible for these violent crimes. ","image":"http://stephenking.com/images/novel/1/hardcover_prop_embed.jpg","id":95},{"title":"Dark Love","date":"August 1996","text":" Dark LoveFormats: PaperbackFirst Edition Release Date:August, 1996Edited By:Nancy A. Collins, Edward E.Kramer, and Martin H. GreenbergSynopsis:Includes \"Lunch at the Gotham Cafe\" ","image":"http://stephenking.com/images/anthology/42/dark_love_pb.jpg","id":96},{"title":"The Dark Man","date":"April 2004","text":" The Dark ManSynopsis: ","image":"http://stephenking.com/images/other_project/4/devils_wine.jpg","id":97},{"title":"The Dark Man","date":"July 2013","text":" The Dark ManFormats: Formats: Hardcover / Trade HardcoverFirst Edition Release Date: July, 2013Synopsis: ","image":"http://stephenking.com/images/limited_edition/the_dark_man/the_dark_man_prop_embed.jpg","id":98},{"title":"Dark Screams: Volume One","date":"December 2014","text":" Dark Screams: Volume OneFormats: eBookFirst Edition Release Date:December, 2014Edited By:Brian James Freeman and Richard ChizmarSynopsis:Stephen King, Kelley Armstrong, Bill Pronzini, Simon Clark, and Ramsey Campbell are the first contributors to a mind-bending new series of short-story collections that push the boundaries of horror and dark suspense to the bleeding edge. From Brian James Freeman and Richard Chizmar of the acclaimed Cemetery Dance Publications,Dark Screams: Volume One reaches across genres to take readers beyond the precipice of mortal toil and into the glimmering void of irreality and beyond. ","image":"http://stephenking.com/images/anthology/77/darkscreamsvol01.jpg","id":99},{"title":"Dark Thoughts on Writing","date":"December 1996","text":" Dark Thoughts on WritingFormats: PaperbackFirst Edition Release Date:1997Edited By:Stanley WiaterSynopsis:Subtitled: Advice and Commentary from Fifty Masters of Fear and Suspenseincludes comments from King ","image":"http://stephenking.com/images/anthology/18/darkthoughts.pb.jpg","id":100},{"title":"The Dark Tower","date":"December 2003","text":" The Dark TowerFormats: Formats: HardcoverFirst Edition Release Date: 2004Synopsis:Deluxe limited edition (published in two volumes) of 1,500 numbered copies with slipcase, signed by King and Whelan.Trade edition of 5,000 copies, signed by Whelan. ","image":"http://stephenking.com/images/limited_edition/37/le_trade_paperback.jpg","id":101},{"title":"The Dark Tower","date":"September 2004","text":" The Dark TowerFormats: Hardcover / Paperback / Trade / Limited Edition / eBook / Audio / / KindleFirst Edition Release Date:September, 2004Synopsis:Roland’s ka-tet is reunited, but not without cost.  The last episode of the story takes them on the final stretch of their journey to The Dark Tower.  Though they have rescued Susannah, there are still enemies who must be dealt with along the way and who could be their ultimate destruction.  Constant readers will recognize characters from past books, who like the ka-tet, have found themselves caught in the spider's web spun bythe Crimson King? Gan?  Questions are answered and others asked. The journey is long and ka is but a wheel.  ","image":"http://stephenking.com/images/books/dark_tower/hardcover_prop_embed.jpg","id":102},{"title":"The Dark Tower: Song of Susannah","date":"December 2003","text":" The Dark Tower: Song of SusannahFormats: Formats: HardcoverFirst Edition Release Date: 2004Synopsis:Deluxe limited edition of 1,400 numbered copies with slipcase, signed by King and AndersonTrade edition of 3,500 copies, signed by Darrel Anderson ","image":"http://stephenking.com/images/limited_edition/36/dt6deluxe.jpg","id":103},{"title":"The Dark Tower: Song of Susannah","date":"June 2004","text":" The Dark Tower: Song of SusannahFormats: Hardcover / Paperback / Trade / Limited Edition / eBook / Audio / KindleFirst Edition Release Date:June, 2004Synopsis:Susannah, now pregnant, has yet another taking control of her.  The demon-mother, Mia, uses Susannah and Black Thirteen to transport to New York City of 1999.  Jake, Oy, and Pere Callahan must rescue Susannah while Eddie and Roland transport to the Maine of 1977.  A vacant lot in New York is the prize that must be saved and ties these together. ","image":"http://stephenking.com/images/books/song_of_sussanah/hardcover_prop_embed.jpg","id":104},{"title":"The Dark Tower: The Drawing of the Three","date":"June 2003","text":" The Dark Tower: The Drawing of the ThreeFormats: Hardcover / Paperback / Trade / Limited Edition / eBook / Audio / KindleFirst Edition Release Date:June, 2003Synopsis:Part II of an epic saga. Roland, the last gunslinger, encounters three mysterious doorways on the beach. Each one enters into a different person living in New York. Through these doorways, Roland draws the companions who will assist him on his quest to save the Dark Tower.  ","image":"http://stephenking.com/images/novel/12/hardcover2.jpg","id":105},{"title":"The Dark Tower: The Drawing of the Three","date":"December 1986","text":" The Dark Tower: The Drawing of the ThreeFormats: Formats: HardcoverFirst Edition Release Date: 1987Synopsis:Limited edition of 850 numbered copies (800 of which were offered for sale to the public), with dust jacket and slipcase, signed by the author and artist.Limited edition of 35 lettered (A-Z, A-II) copies, with dust jacket and slipcase, signed by the author and artist.12 Publisher's Copies; 40 Author's Copies; 10 Artist's Copies; indeterminate number of Presentation Copies; 5 copies, signed by King and Hale designated \"Artist's Copy\"Trade edition of 30,000 copies, unsigned. ","image":"http://stephenking.com/images/books/drawing_of_the_three/hardcover_prop_embed.jpg","id":106},{"title":"The Dark Tower: The Gunslinger","date":"June 2003","text":" The Dark Tower: The GunslingerFormats: Hardcover / Paperback / Trade / Limited Edition / eBook / Audio / KindleFirst Edition Release Date:June, 2003Synopsis:The opening chapter in the epic Dark Tower series. Roland, the last gunslinger, in a world where time has moved on, pursues his nemesis, The Man in Black, across a desert. Roland's ultimate goal is the Dark Tower, the nexus of all universes. This mysterious icon's power is failing, threatening everything in existence.   ","image":"http://stephenking.com/images/novel/7/hardcover2_prop_embed.jpg","id":107},{"title":"The Dark Tower: The Gunslinger","date":"December 1981","text":" The Dark Tower: The GunslingerFormats: Formats: HardcoverFirst Edition Release Date: 1982Synopsis:500 copies, with dust jacket and slipcase, signed by Stephen King and Michael Whelan35 lettered copies (A-Z, AA-II), with dust jacket and slipcase, signed by Stephen King and Michael Whelan12 copies, reserved for the publisher, marked as \"Publisher's Copy\"40 copies, reserved for the author, marked \"Author's Copy\"10 copies, reserved for the artist, marked \"Artist's Copy\"25 (?) copies, unsigned, without slipcase marked \"Presentation Copy\"10,000 copies First Trade Edition published in 198210,000 copiesSecond Trade Edition published in 198415,000 copies Third Trade Edition published in 1998 [Printed for inclusion in a Dark Tower set with , second trade edition of The Drawing of the Three, and first trade edition of The Waste Lands, and a slipcase for the three books.] ","image":"http://stephenking.com/images/books/gunslinger/hardcover_prop_embed.jpg","id":108},{"title":"The Dark Tower: The Waste Lands","date":"June 2003","text":" The Dark Tower: The Waste LandsFormats: Hardcover / Paperback / Trade / Limited Edition / eBook / Audio / KindleFirst Edition Release Date:June, 2003Synopsis:Part III of an epic saga. Roland and his companions, Eddie and Susannah Dean, find the Path of the Beam that will lead them to the Dark Tower. Along the way, Roland adds two new members to his ka-tet (a group united for a specific purpose). In the decaying city of Lud, they encounter new dangers, including a sentient train that has gone insane. ","image":"http://stephenking.com/images/novel/13/hardcover2_prop_embed.jpg","id":109},{"title":"The Dark Tower: The Waste Lands","date":"December 1990","text":" The Dark Tower: The Waste LandsFormats: Formats: HardcoverFirst Edition Release Date: 1991Synopsis:Illustrated by Ned DameronLimited edition of 1,250 numbered copies (1,200 of which were offered for sale), with dust jacket and slipcase, signed by author and artist.Limited edition of 26 lettered (A-Z) copies with dust jacket and slipcase, signed by author and artist.12 as Publisher's Copy, 40 as Author's Copy, 10 as Artist's Copy.Trade edition of 40,000 copies, unsigned.This book was also later included as part of a 3 volume set in a slipcase with a third trade edition ofThe Gunslinger and a second trade edition of The Drawing of the Three. ","image":"http://stephenking.com/images/books/waste_lands/hardcover_prop_embed.jpg","id":110},{"title":"The Dark Tower: The Wind Through the Keyhole","date":"February 2012","text":" The Dark Tower: The Wind Through the KeyholeFormats: Formats: HardcoverFirst Edition Release Date: February, 2012Synopsis:We join Roland and his ka-tet as a ferocious storm halts their progress along the Path of the Beam. As they shelter from the screaming wind and snapping trees, Roland tells them not just one strange tale, but two--and in doing so sheds fascinating light on his own troubled past.In his early days as a gunslinger, in the guilt-ridden year following his mother's death, Roland is sent by his father to a ranch to investigate a recent slaughter. Here Roland discovers a bloody churn of bootprints, clawed animal tracks and terrible carnage--evidence that the 'skin-man', a shape-shifter, is at work. There is only one surviving witness: a brave but terrified boy called Bill Streeter.Roland, himself only a teenager, calms the boy by reciting a story from the Book of Eld that his mother used to read to him at bedtime, 'The Wind Through The Keyhole.' 'A person's never too old for stories,' he says to Bill. 'Man and boy, girl and woman, we live for them.' ","image":"http://stephenking.com/images/books/wind_through_the_keyhole/limited_edition/wind_through_the_keyhole_le_prop_embed.jpg","id":111},{"title":"The Dark Tower: The Wind Through the Keyhole","date":"April 2012","text":" The Dark Tower: The Wind Through the KeyholeFormats: Hardcover, eBook, Audiobook, PaperbackFirst Edition Release Date:April, 2012Synopsis:We join Roland and his ka-tet as a ferocious storm halts their progress along the Path of the Beam. As they shelter from the screaming wind and snapping trees, Roland tells them not just one strange tale, but two--and in doing so sheds fascinating light on his own troubled past.In his early days as a gunslinger, in the guilt-ridden year following his mother's death, Roland is sent by his father to a ranch to investigate a recent slaughter. Here Roland discovers a bloody churn of bootprints, clawed animal tracks and terrible carnage--evidence that the 'skin-man',a shape-shifter, is at work. There is only one surviving witness: a brave but terrified boy called Bill Streeter.Roland, himself only a teenager, calms the boy by reciting a story from the Book of Eld that his mother used to read to him at bedtime, 'The Wind Through The Keyhole.''A person's never too old for stories,' he says to Bill. 'Man and boy, girl and woman, we live for them.'More Information ","image":"http://stephenking.com/images/books/wind_through_the_keyhole/wind_through_the_keyhole_prop_embed.jpg","id":112},{"title":"The Dark Tower: Wizard and Glass (I)","date":"December 1996","text":" The Dark Tower: Wizard and Glass (I)Formats: Formats: HardcoverFirst Edition Release Date: 1997Synopsis:Two Volume Limited edition of 1,250 copies (1,200 offered for sale), with dust jacket and slipcase, signed by author and artist.Two Volume Limited edition of 26 lettered copies, with dust jacket and slipcase, signed by author and artist.Trade edition of 40,000 copies, unsigned. ","image":"http://stephenking.com/images/books/wizard_and_glass/hardcover_prop_embed.jpg","id":113},{"title":"The Dark Tower: Wizard and Glass (II)","date":"December 1996","text":" The Dark Tower: Wizard and Glass (II)Formats: Formats: HardcoverFirst Edition Release Date: 1997Synopsis:Limited edition of 500 numbered copies, with slipcase, signed by King via inserted book plate. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":114},{"title":"The Dark Tower: Wizard and Glass","date":"June 2003","text":" The Dark Tower: Wizard and GlassFormats: Hardcover / Paperback / Trade / Limited Edition / eBook / Audio / KindleFirst Edition Release Date:June, 2003Synopsis:Part IV of an epic quest. Roland the Gunslinger and his followers have to contend with a sentient monorail intent on killing itself and taking them with it. While seeking to return to the Path of the Beam that will lead them to the Dark Tower, Roland tells his friends a story about the tragic loss of his first love, Susan Delgado. ","image":"http://stephenking.com/images/novel/14/hardcover2_prop_embed.jpg","id":115},{"title":"The Dark Tower: Wolves of the Calla","date":"December 2002","text":" The Dark Tower: Wolves of the CallaFormats: Formats: HardcoverFirst Edition Release Date: 2003Synopsis:Deluxe limited edition (published in 2 volumes) of 1,350 numbered copies with slipcase, signed by King and WrightsonTrade edition of 3,500 copies, signed and numbered by Bernie Wrightson ","image":"http://stephenking.com/images/limited_edition/35/dt5_dxvol_1.jpg","id":116},{"title":"The Dark Tower: Wolves of the Calla","date":"November 2003","text":" The Dark Tower: Wolves of the CallaFormats: Hardcover / Paperback / Trade / Limited Edition / eBook / Audio / KindleFirst Edition Release Date:November, 2003Synopsis:After escaping the perilous wreckage of Blaine the insane Mono and eluding the evil clutches of the vindictive sorcerer Randall Flagg, Roland and his ka-tet find themselves back on the southeasterly path of the Beam. Here, in the borderlands that lie between Mid-World and End-World, Roland and his friends are approached by a frightened band of representatives from the nearby town of Calla Bryn Sturgis. In less than a month, the Calla will be attacked by the Wolves--those masked riders that gallop out of Thunderclap once a generation to steal the town's children. The Calla folken need the kind of help that only gunslingers can give, and if the tet agrees to help, the town's priest--Father Callahan, once of 'Salem's Lot, Maine--promises to give them Black Thirteen, the most potent and treacherous of Maerlyn's magic balls. He used it to enter Mid-World, and now it sleeps fitfully beneath the floorboards of his church. Meanwhile, in the New York of 1977, the Sombra Corporation plots to destroy the lot at Second Avenue and Forty-Sixth Street. How can Roland and his friends both save the rose and fight the Wolves? Only by using the magic of Black Thirteen, but how can anyone trust this sinister and treacherous object which is, in actuality, the eye of the Crimson King himself? Time is running out on all levels of the Tower, but unless our ka-tet can defeat the minions of Thunderclap both in our world and in Mid-World, they will never reach that great lynchpin of the time/space continuum which, even now, begins to totter . . . ","image":"http://stephenking.com/images/novel/16/hardcover_prop_embed.jpg","id":117},{"title":"Darkness","date":"December 2009","text":" DarknessFormats: PaperbackFirst Edition Release Date:2010Edited By:Ellen DatlowSynopsis:Contains \"Chattery Teeth\" ","image":"http://stephenking.com/images/anthology/63/darkness.2decades086.jpg","id":118},{"title":"The Dead Zone","date":"August 1979","text":" The Dead ZoneFormats: Hardcover / Paperback / Movie / DVDFirst Edition Release Date:August, 1979Synopsis:Waking up from a five-year coma after a car accident, former schoolteacher Johnny Smith discovers that he can see people's futures and pasts when he touches them. Many consider his talent a gift; Johnny feels cursed. His fiance married another man during his coma and people clamor for him to solve their problems. When Johnny has a disturbing vision after he shakes the hand of an ambitious and amoral politician, he must decide if he should take drastic action to change the future.   ","image":"http://stephenking.com/images/books/dead_zone/hardcover_prop_embed.jpg","id":119},{"title":"The Death of Jack Hamilton","date":"March 2002","text":" The Death of Jack HamiltonSynopsis:The tale of Depression-era outlaws on the run. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":120},{"title":"Death","date":"December 1981","text":" DeathFormats: HardcoverFirst Edition Release Date:1982Edited By:Stuart SchiffSynopsis:Collection of short stories by various authors including King, Fritz Leiber, Dennis Etchison et al.Contains short story, \"It Grows on You\". ","image":"http://stephenking.com/images/anthology/19/death.jpg","id":121},{"title":"Dedication","date":"October 1993","text":" DedicationSynopsis:“Dedication” is the story of a maid working in a hotel who uses a black magic spell in the hopes of harnessing the talent of one of the hotel’s frequent guests—an eccentric writer—and passing it on to her unborn son. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":122},{"title":"Demons","date":"December 1986","text":" DemonsFormats: PaperbackFirst Edition Release Date:1987Edited By:Synopsis:Collection of short stories by various authors including King and Harlan Ellison.Contains short story \"The Mangler\". ","image":"http://stephenking.com/images/anthology/20/demons.jpg","id":123},{"title":"Desperation/The Regulators (Box Set)","date":"December 1995","text":" Desperation/The Regulators (Box Set)Formats: Formats: HardcoverFirst Edition Release Date: 1996Synopsis:Limited edition of 250 copies.Desperation is signed and numbered by King on an inserted book plate, but The Regulatorsis not. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":124},{"title":"Desperation","date":"December 1995","text":" DesperationFormats: Formats: HardcoverFirst Edition Release Date: 1996Synopsis:Deluxe limited edition of 2,000 numbered copies, with traycase, signed by King and Maitz.Gift edition of 4,000 copies, with dust jacket and slipcase, unsigned. ","image":"http://stephenking.com/images/limited_edition/24/desperation_le_prop_embed.jpg","id":125},{"title":"Desperation","date":"December 1995","text":" DesperationFormats: Hardcover / Paperback / TV Movie / DVDFirst Edition Release Date:1996Synopsis:Located off a desolate stretch of Interstate 50, Desperation, Nevada has few connections with the rest of the world. It is a place, though, where the seams between worlds are thin. Miners at the China Pit have accidentally broken into another dimension and released a horrific creature known as Tak, who takes human form by hijacking some of the town's residents. The forces of good orchestrate a confrontation between this ancient evil and a group of unsuspecting travelers who are lured to the dying town. This rag-tag band of unwilling champions is led by a young boy who speaks to God.  ","image":"http://stephenking.com/images/books/desperation/hardcover_prop_embed.jpg","id":126},{"title":"The Devil's Wine","date":"April 2004","text":" The Devil's WineFormats: HardcoverFirst Edition Release Date:April, 2004Edited By:Tom PiccirilliSynopsis:Anthology of poetry by various authors. ","image":"http://stephenking.com/images/other_project/4/devils_wine.jpg","id":127},{"title":"Different Seasons","date":"August 1982","text":" Different SeasonsFormats: Hardcover / Paperback / AudiobookFirst Edition Release Date:August, 1982Synopsis: Rita Hayworth and Shawshank Redemption--the most satisfying tale of unjust imprisonment and offbeat escape since The Count of Monte Cristo.     Apt Pupil--a golden California schoolboy and an old man whose hideous past he uncovers enter into a fateful and chilling mutual parasitism.     The Body--four rambunctious young boys venture into the Maine woods and in sunlight and thunder find life, death, and intimations of their own mortality.     The Breathing Method--a tale told in a strange club about a woman determined to give birth no matter what.  ","image":"http://stephenking.com/images/books/different_seasons/hardcover_prop_embed.jpg","id":128},{"title":"The Do-It-Yourself Bestseller: A Workbook","date":"December 1981","text":" The Do-It-Yourself Bestseller: A WorkbookFormats: Trade PaperbackFirst Edition Release Date:1982Edited By:Tom Silberkleit & Jerry BiedermanSynopsis:Contains SKYBAR (the beginning and end of novel written by King; reader supplies the middle) ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":129},{"title":"Doctor Sleep","date":"December 2012","text":" Doctor SleepFormats: Hardcover, eBook, AudiobookFirst Edition Release Date:2013Synopsis:On highways across America, a tribe of people called The True Knot travel in search of sustenance. They look harmless—mostly old, lots of polyester, and married to their RVs. But as Dan Torrance knows, and tween Abra Stone learns, The True Knot are quasi-immortal, living off the “steam” that children with the “shining” produce when they are slowly tortured to death.Haunted by the inhabitants of the Overlook Hotel where he spent one horrific childhood year, Dan has been drifting for decades, desperate to shed his father’s legacy of despair, alcoholism, and violence. Finally, he settles in a New Hampshire town, an AA community that sustains him, and a job at a nursing home where his remnant “shining” power provides the crucial final comfort to the dying. Aided by a prescient cat, he becomes “Doctor Sleep.”Then Dan meets the evanescent Abra Stone, and it is her spectacular gift, the brightest shining ever seen, that reignites Dan’s own demons and summons him to a battle for Abra’s soul and survival. This is an epic war between good and evil, a gory, glorious story that will thrill the millions of hyper-devoted readers of The Shining and wildly satisfy anyone new to the territory of this icon in the King canon.Cover Reveal ","image":"http://stephenking.com/images/books/doctor_sleep/doctor_sleep_property_embed.jpg","id":130},{"title":"Doctor Sleep","date":"September 2013","text":" Doctor SleepFormats: Formats: HardcoverFirst Edition Release Date: September, 2013Synopsis:On highways across America, a tribe of people called The True Knot travel in search of sustenance. They look harmless—mostly old, lots of polyester, and married to their RVs. But as Dan Torrance knows, and tween Abra Stone learns, The True Knot are quasi-immortal, living off the “steam” that children with the “shining” produce when they are slowly tortured to death.Haunted by the inhabitants of the Overlook Hotel where he spent one horrific childhood year, Dan has been drifting for decades, desperate to shed his father’s legacy of despair, alcoholism, and violence. Finally, he settles in a New Hampshire town, an AA community that sustains him, and a job at a nursing home where his remnant “shining” power provides the crucial final comfort to the dying. Aided by a prescient cat, he becomes “Doctor Sleep.”Then Dan meets the evanescent Abra Stone, and it is her spectacular gift, the brightest shining ever seen, that reignites Dan’s own demons and summons him to a battle for Abra’s soul and survival. This is an epic war between good and evil, a gory, glorious story that will thrill the millions of hyper-devoted readers of The Shining and wildly satisfy anyone new to the territory of this icon in the King canon. ","image":"http://stephenking.com/images/books/doctor_sleep/limited/doctor_sleep_le_prop_embed.jpg","id":131},{"title":"The Doctor's Case","date":"December 1985","text":" The Doctor's CaseSynopsis:A crotchety old British Lord is murdered. Lord Hull’s wife and three sons are all suspects, and it is up to Holmes and Watson to find out the truth. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":132},{"title":"Dolan's Cadillac","date":"December 1988","text":" Dolan's CadillacFormats: Formats: HardcoverFirst Edition Release Date: 1989Synopsis:Limited edition of 1,000 numbered copies, quarter cloth with printed boards, signed by the author.Deluxe limited edition of 250 numbered copies, quarter-bound (with marbled paper), signed by the author.Limited edition of 26 lettered (A-Z) copies, half-bound (leather with marbled paper), in slipcase, signed by the author.Indeterminate number of presentation copies in each of the binding styles ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":133},{"title":"Dolan's Cadillac","date":"October 1993","text":" Dolan's CadillacSynopsis:Wealthy crime-boss Jimmy Dolan brutally murders a woman who is scheduled to testify against him, and her husband spends the next seven years plotting his revenge. Haunted by the voice of his dead wife, he will stop at nothing to exact his vengeance and allow his wife to rest in peace. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":134},{"title":"Dolores Claiborne","date":"December 1992","text":" Dolores ClaiborneFormats: Hardcover / Paperback / Audio / Movie / DVDFirst Edition Release Date:1993Synopsis:Suspected of killing Vera Donovan, her wealthy employer, Dolores Claiborne tells police the story of her life, harkening back to her disintegrating marriage and the suspicious death of her violent husband, Joe St. George, thirty years earlier. Dolores also tells of Vera's physical and mental decline and of her loyalty to an employer who has become emotionally demanding in recent years.   ","image":"http://stephenking.com/images/books/dolores_claiborne/hardcover_prop_embed.jpg","id":135},{"title":"Donovan's Brain","date":"April 2004","text":" Donovan's BrainSynopsis: ","image":"http://stephenking.com/images/other_project/4/devils_wine.jpg","id":136},{"title":"Dreamcatcher","date":"March 2001","text":" DreamcatcherFormats: Hardcover / Paperback / Audio / eBook / Kindle / TV Movie / DVDFirst Edition Release Date:March, 2001Synopsis:Four lifelong friends gather in the woods of western Maine for their annual hunting trip. When they were young, they were bound together forever by an act of bravery involving a fifth friend, whose influence has given these men special powers. Their trip is disrupted when a stranger, disoriented and delirious, wanders into camp, muttering about light in the sky. Before long, the friends find themselves pitted against an alien invasion and must draw on their old friend's strength once again to fight for their lives.  ","image":"http://stephenking.comhttp://www.stephenking.com/images/books/dreamcatcher/hardcover_prop_embed.jpg","id":137},{"title":"Drunken Fireworks","date":"November 2015","text":" Drunken FireworksSynopsis:A salt-of-the-earth Maine native recounts how a friendly annual summer fireworks show rivalry with his neighbor across the lake gradually spirals out of control. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":138},{"title":"Duma Key","date":"January 2008","text":" Duma KeyFormats: Hardcover / Paperback / Audio / eBook / KindleFirst Edition Release Date:January, 2008Synopsis:After a construction accident in which he loses his right arm and his divorce, Edgar Freemantle moves from Minnesota to Florida to begin what his psychiatrist described as a \"geographic cure.\"  He rediscovers his love of painting and finds that he is good at it but his paintings seem to have something \"more\" to them.  On Duma Key he also finds a new friendship with Wireman, a kindred spirit seeking refuge there as a caretaker for Elizabeth Eastlake.  Elizabeth's past also contains painful memories that have been reawakened bringing all of them together to face an evil entity named Perse.  ","image":"http://stephenking.comhttp://www.stephenking.com/images/books/duma_key/hardcover_prop_embed.jpg","id":139},{"title":"The Dune","date":"November 2015","text":" The DuneSynopsis:Retired Florida Supreme Court Judge Harvey Beecher tells his lawyer about a mysterious sand dune on an unnamed island a short distance off the Gulf coastline of his family's property. Harvey first visited the island at the age of ten in 1932, after his grandfather, a scoundrel and land speculator who'd created the family fortune, told him Blackbeard's treasure might be buried there. Traveling to the island became a daily addiction for Harvey...and now his lawyer is about to discover the shocking reason why. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":140},{"title":"End of Watch","date":"June 2016","text":" End of WatchFormats: HardcoverFirst Edition Release Date:June, 2016Synopsis:End of Watch is the spectacular finale to the New York Times bestselling trilogy that began with Mr. Mercedes (winner of the Edgar Award) and Finders Keepers—In End of Watch, the diabolical “Mercedes Killer” drives his enemies to suicide, and if Bill Hodges and Holly Gibney don’t figure out a way to stop him, they’ll be victims themselves.More InformationEOW Book Tour Information (SOLD OUT) ","image":"http://stephenking.com/images/novel/68/end_of_watch_rev_lr.jpg","id":141},{"title":"The End of the Whole Mess","date":"October 1993","text":" The End of the Whole MessSynopsis:Howard Forney’s journal recounts the intense promise and disastrous effects of his younger brother Bobby’s genius. When Bobby discovers an unknown chemical that diminishes anger and hostility, he believes he’s found the path to world peace. Only after utilizing an erupting volcano to spread the chemical throughout the world does Bobby learn that the chemical also causes dementia and eventually death. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":142},{"title":"Ever Et Raw Meat? and Other Weird Questions","date":"December 1999","text":" Ever Et Raw Meat? and Other Weird QuestionsSynopsis:Essay written in 1987 about the strange questions Stephen has been asked by fans. ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":143},{"title":"Everything's Eventual","date":"March 2002","text":" Everything's EventualFormats: Hardcover / Paperback / ebook / Kindle / AudiobooksFirst Edition Release Date:March, 2002Synopsis: ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":144},{"title":"Everything's Eventual","date":"March 2002","text":" Everything's EventualSynopsis:Dinky Earnshaw--a 19-year-old pizza delivery boy--gets hired by a mysterious stranger for a unique and totally \"eventual\" (awesome) job. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":145},{"title":"The Evil Image: Two Centuries of Gothic Short Fiction and Poetry","date":"September 1983","text":" The Evil Image: Two Centuries of Gothic Short Fiction and PoetryFormats: PaperbackFirst Edition Release Date:September, 1983Edited By:Patricia L. Skarda and Nora Crow JaffeSynopsis:includes comments on King and Suffer the Little Children ","image":"http://stephenking.com/images/anthology/21/evilimage.jpg","id":146},{"title":"The Eyes of the Dragon","date":"December 1983","text":" The Eyes of the DragonFormats: Formats: HardcoverFirst Edition Release Date: 1984Synopsis:1,000 copies, numbered (1-1000) in black ink, with slipcase.250 copies, numbered (1001-1250) in red ink, with slipcase. Originally reserved for private distribution and not intended for sale to the public.26 copies, lettered (A-Z) in black ink. Originally reserved for private distribution and not intended for sale to the public.Note: The large image to the left is taken from the title page. The simple red hardcover is shown below: ","image":"http://stephenking.com/images/limited_edition/10/le_hardcover_inner.jpg","id":147},{"title":"The Eyes of the Dragon","date":"February 1987","text":" The Eyes of the DragonFormats: Hardcover / Paperback / Limited EditionFirst Edition Release Date:February, 1987Synopsis:Once upon a time, in the Kingdom of Delain, King Roland is murdered and his son and heir, Peter, is framed for the crime. Peter and his loyal friends must battle an evil wizard and Peter's usurper brother, Thomas, for the throne. Imprisoned in a tower, Peter conceives an escape plan that will take him years to execute before taking on Flagg, the powerful sorcerer who has masterminded this coup.  ","image":"http://stephenking.com/images/books/eyes_of_the_dragon/hardcover_prop_embed.jpg","id":148},{"title":"Faces of Fear","date":"December 1989","text":" Faces of FearSynopsis:Interview of Stephen by Douglas E. Winter covering his thoughts on writing ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":149},{"title":"Fair Extension","date":"November 2010","text":" Fair ExtensionSynopsis:Harry Streeter, who is suffering from cancer, decides to make a deal with the devil but, as always, there is a price to pay. ","image":"http://stephenking.com/images/books/full_dark_no_stars/full_dark_no_stars_prop_embed.jpg","id":150},{"title":"Faithful","date":"September 2005","text":" FaithfulFormats: HardcoverFirst Edition Release Date:September, 2005Synopsis:Co-authored with writer Stewart O'Nan, this non-fiction book covers the 2004 season of the Boston Red Sox. ","image":"http://stephenking.com/images/books/faithful/hardcover_prop_embed.jpg","id":151},{"title":"Fantasy Annual III","date":"April 1981","text":" Fantasy Annual IIIFormats: PaperbackFirst Edition Release Date:April, 1981Edited By:Terry CarrSynopsis:Fantasy anthology; . follow the masters of the fantastic into uncharted, unexpected, and unforgettable worlds .; stories include: The Crate/ Collaborating/ Fate's Purse/ The Things That Are Gods/ Flop Sweat/ Rent Control/ The Button Molder/ The Extraordinary Voyages of Am?lie Bertrand/ Eumenides in the Fourth-Floor Lavatory/ The White Horse Child/ Trill Coster's Burden/ Pie Row Joe/ The Ancient Mind at Work.Contains short story \"The Crate\". ","image":"http://stephenking.com/images/anthology/22/fantasyiii.jpg","id":152},{"title":"Fantasy Annual IV","date":"December 1980","text":" Fantasy Annual IVFormats: HardcoverFirst Edition Release Date:1981Edited By:Terry CarrSynopsis:Collection of short stories by various authors including King, Thomas M. Disch, Edward Bryant, Mary Pangborn et al.Contains short story \"The Monkey\". ","image":"http://stephenking.com/images/anthology/23/fantasyiv.jpg","id":153},{"title":"Father's Day","date":"December 1999","text":" Father's DaySynopsis:Patriarch Nathan Grantham was killed on Father’s Day by his long-suffering daughter Bedelia. On her way to the annual Father’s Day dinner with the remaining descendants, Bedelia stops at the cemetery where Nathan is buried accidentally spilling her whiskey bottle on his grave with unexpected consequences. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":154},{"title":"Fear Itself","date":"June 1984","text":" Fear ItselfFormats: PaperbackFirst Edition Release Date:June, 1984Edited By:Tim Underwood and Chuck MillerSynopsis:subtitled The Horror Fiction of Stephen King; includes Foreword by Kingoriginally published in 1982 as a limited edition by Underwood-Miller Publishers ","image":"http://stephenking.com/images/anthology/25/fearitself.jpg","id":155},{"title":"Fenway and the Great White Whale","date":"December 1999","text":" Fenway and the Great White WhaleSynopsis:Essay about Fenway Park and the Boston Red Sox, written forMajor League Baseball ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":156},{"title":"The Fifth Quarter","date":"October 1993","text":" The Fifth QuarterSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":157},{"title":"Finders Keepers","date":"June 2015","text":" Finders KeepersFormats: Hardcover, eBook, AudiobookFirst Edition Release Date:June, 2015Synopsis:A masterful, intensely suspenseful novel about a reader whose obsession with a reclusive writer goes far too far—a book about the power of storytelling, starring the same trio of unlikely and winning heroes King introduced in Mr. Mercedes.\"Wake up genius.\" So begins King’s instantly riveting story about a vengeful reader. The genius is John Rothstein, an iconic author who created a famous character, Jimmy Gold, but who hasn’t published a book for decades. Morris Bellamy is livid, not just because Rothstein has stopped providing books, but because the nonconformist Jimmy Gold has sold out for a career in advertising. Morris kills Rothstein and empties his safe of cash, yes, but the real treasure is a trove of notebooks containing at least one more Gold novel.Morris hides the money and the notebooks, and then he is locked away for another crime. Decades later, a boy named Pete Saubers finds the treasure, and now it is Pete and his family that Bill Hodges, Holly Gibney, and Jerome Robinson must rescue from the ever-more deranged and vengeful Morris when he’s released from prison after thirty-five years.Not since Misery has King played with the notion of a reader whose obsession with a writer gets dangerous. Finders Keepers is spectacular, heart-pounding suspense, but it is also King writing about how literature shapes a life—for good, for bad, forever.More Information ","image":"http://stephenking.com/images/books/finders-keepers/finders_keepers_prop_embed.jpg","id":158},{"title":"Firestarter","date":"December 1979","text":" FirestarterFormats: Formats: HardcoverFirst Edition Release Date: 1980Synopsis:Deluxe Limited: 26 lettered (A-Z), asbestos-bound, signed by King Limited:725 numbered copies with dust jacket and slipcase, signed by King ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":159},{"title":"Firestarter","date":"September 1980","text":" FirestarterFormats: Hardcover / Paperback / Limited Edition / Movie / DVDFirst Edition Release Date:September, 1980Synopsis:The Department of Scientific Intelligence (aka \"The Shop\") never anticipated that two participants in their research program would marry and have a child. Charlie McGee inherited pyrokinetic powers from her parents, who had been given a low-grade hallucinogen called \"Lot Six\" while at college. Now the government is trying to capture young Charlie and harness her powerful firestarting skills as a weapon. ","image":"http://stephenking.com/images/books/firestarter/hardcover_prop_embed.jpg","id":160},{"title":"Five to One, One in Five","date":"November 2016","text":" Five to One, One in FiveSynopsis:Written expressly forHearts in Suspension, Stephen sheds his fictional persona and takes on the challenge of a nonfiction return to his undergraduate experience. The stereoscopic combination of \"Five to One, One in Five\" and \"Hearts in Atlantis,\" told with Stephen's characteristic blend of canny insight and self-deprecating humor, create a revealing portrait of Stephen as a young man and a ground-level tableau of this highly charged time. ","image":"http://stephenking.com/images/anthology/80/heartsinsuspension_cover.png.jpg","id":161},{"title":"For Owen","date":"June 1985","text":" For OwenSynopsis: ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":162},{"title":"Foreword to Night Shift","date":"December 1999","text":" Foreword to Night ShiftSynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":163},{"title":"Four Past Midnight","date":"September 1990","text":" Four Past MidnightFormats: Hardcover / Paperback / AudiobooksFirst Edition Release Date:September, 1990Synopsis: ","image":"http://stephenking.com/images/books/four_past_midnight/hardcover_prop_embed.jpg","id":164},{"title":"From A Buick 8","date":"December 2001","text":" From A Buick 8Formats: Hardcover / Paperback / Limited Edition / eBook / Kindle / AudioFirst Edition Release Date:2002Synopsis:Shortly after his father, a Pennsylvania state trooper, is killed in a senseless automobile accident, Ned Wilcox discovers that the members of Troop D have a secret concealed behind their headquarters. Curtis Wilcox's friends and colleagues take turns relating the twenty-year history of the mysterious Buick Roadmaster locked in Shed B and how its discovery and unexplained behavior has captivated the tightly knit group of men for two decades. The Buick seems to be a conduit to another reality and every now and then it breathes, inhaling a little bit of this world, exhaling a little bit of whatever world it came from. ","image":"http://stephenking.com/images/books/from_a_buick_8/hardcover_prop_embed.jpg","id":165},{"title":"From a Buick 8","date":"December 2001","text":" From a Buick 8Formats: Formats: HardcoverFirst Edition Release Date: 2002Synopsis:Limited edition of 750 numbered copies, with traycase, signed by King and Wrightson.Deluxe limited edition of 52 lettered copies, with traycase, signed by King and Wrightson.Gift edition of 1,750 copies in slipcase, unsigned. ","image":"http://stephenking.com/images/limited_edition/30/from_a_buick_8_le_prop_embed.jpg","id":166},{"title":"From the Borderlands","date":"December 2002","text":" From the BorderlandsFormats: PaperbackFirst Edition Release Date:2003Edited By:Elizabeth E. and Thomas F. MonteleoneSynopsis:Previously published asBorderlands 5 ","image":"http://stephenking.com/images/anthology/44/from_the_borderlands.jpg","id":167},{"title":"Full Dark, No Stars","date":"November 2010","text":" Full Dark, No StarsFormats: Hardcover / Paperback / Kindle / Audiobook / Ebook / MP3First Edition Release Date:November, 2010Synopsis:Full Dark, No Stars is a collection of four intense short stories with retribution as the central theme. Released in the fall of 2010 in hardcover and audiobook formats, Full Dark, No Stars is a powerful read featuring some of Stephen's most graphic and merciless content to date.Update: The paperback edition of Full Dark, No Stars contains a new short story by Stephen titled Under the Weather that was not included in the orginal hardcover release. (In stores May 24th 2011)Hardcover Promo PageHardcover Limited Promo Page ","image":"http://stephenking.com/images/books/full_dark_no_stars/full_dark_no_stars_prop_embed.jpg","id":168},{"title":"GUNS","date":"January 2013","text":" GUNSFormats: Amazon Kindle SingleFirst Edition Release Date:January, 2013Synopsis:Stephen has written an essay discussing his thoughts on the gun control/gun rights issue facing the U.S., available now as a Kindle Single through Amazon.com.“I think the issue of an America awash in guns is one every citizen has to think about,” said King. “If this helps provoke constructive debate, I’ve done my job.More Information ","image":"http://stephenking.com/images/nonfiction/guns/guns_property_emebed.jpg","id":169},{"title":"The Garden of Reading","date":"December 2004","text":" The Garden of ReadingFormats: HardcoverFirst Edition Release Date:2005Edited By:Michele SlungSynopsis:Reprint of \"The Lawnmower Man\" ","image":"http://stephenking.com/images/anthology/37/garden_of_reading020.jpg","id":170},{"title":"The Genius of \"The Tell-Tale Heart\"","date":"December 2008","text":" The Genius of \"The Tell-Tale Heart\"Synopsis:Stephen's essay on Edgar Allan Poe's classic tale, \"The Tell-Tale Heart\" ","image":"http://stephenking.com/images/anthology/62/in_shadow_of_the_master040.jpg","id":171},{"title":"Gerald's Game","date":"December 1991","text":" Gerald's GameFormats: Hardcover / Paperback / AudioFirst Edition Release Date:1992Synopsis:Gerald and Jessie Burlingame have gone to their summer home on a warm weekday in October for a romantic interlude. After being handcuffed to her bedposts, Jessie tires of her husband's games, but when Gerald refuses to stop she lashes out at him with deadly consequences. Still handcuffed, she is trapped and alone. Painful memories from her childhood bedevil her. Her only company is a hungry stray dog and the sundry voices that populate her mind. As night comes, she is unsure whether it is her imagination or if she has another companion: someone watching her from the corner of her dark bedroom.  ","image":"http://stephenking.com/images/books/geralds_game/hardcover_prop_embed.jpg","id":172},{"title":"The Gingerbread Girl","date":"November 2008","text":" The Gingerbread GirlSynopsis:\"The Gingerbread Girl\" follows the story of Em, who after suffering a devastating loss, starts running. Soon Em runs from her husband and her home all the way to the airport. Looking for solace, Em's running takes her to the Florida Gulf where she settles into the loneliest stretch of Vermillion Key. Once there Em keeps up her running until one day she makes the mistake of looking into the driveway of a man named Pickering. Pickering also enjoys the privacy of Vermillion Key, but the young women he brings there suffer the consequences. Will Em be next? ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":173},{"title":"The Girl Who Loved Tom Gordon","date":"December 2003","text":" The Girl Who Loved Tom GordonFormats: Formats: HardcoverFirst Edition Release Date: 2004Synopsis:Limited edition of 125 numbered copies with slipcase, signed by King. ","image":"http://stephenking.com/images/books/girl_who_loved_tom_gordon_pop_up/hardcover_prop_embed.jpg","id":174},{"title":"The Girl Who Loved Tom Gordon","date":"April 1999","text":" The Girl Who Loved Tom GordonFormats: Hardcover / Paperback / eBook / Kindle / AudioFirst Edition Release Date:April, 1999Synopsis:Nine-year-old Trisha McFarland strays from the path while she and her recently divorced mother and brother take a hike along a branch of the Appalachian Trail. Lost for days, wandering farther and farther astray, Trisha has only her portable radio for comfort. A huge fan of Tom Gordon, a Boston Red Sox relief pitcher, she listens to baseball games and fantasizes that her hero will save her. Nature isn't her only adversary, though - something dangerous may be tracking Trisha through the dark woods.  ","image":"http://stephenking.comhttp://www.stephenking.com/images/books/girl_who_loved_tom_gordon/hardcover_prop_embed.jpg","id":175},{"title":"The Glass Floor","date":"December 1999","text":" The Glass FloorSynopsis:Charles Wharton wishes to see the place where his sister Janine died. Anthony Reynard, her husband, refuses to allow the room, which has since been sealed, to be re-opened.Eventually, Charles will find a way to enter the room with the glass floor, and he'll quickly discover that not all is as it seems.. ","image":"http://stephenking.com/images/short_stories/glass_floor/prop_emebed.jpg","id":176},{"title":"Graduation Afternoon","date":"November 2008","text":" Graduation AfternoonSynopsis:The story tells of a young woman enjoying her high school graduation party at her wealthy boyfriend's suburban Connecticut home and subsequently witnessing the destruction of Manhattan by an atomic bomb. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":177},{"title":"Gramma","date":"June 1985","text":" GrammaSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":178},{"title":"Graveyard Shift","date":"December 1977","text":" Graveyard ShiftSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":179},{"title":"Great Hookers I Have Known","date":"December 1999","text":" Great Hookers I Have KnownSynopsis:Essay about how to write great opening lines that will compel readers to keep reading. ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":180},{"title":"The Green Mile","date":"December 2006","text":" The Green MileFormats: Formats: HardcoverFirst Edition Release Date: 2007Synopsis:52 lettered and signed sets, with one of the original sketches matted in the traycase148 numbered and signed sets, bound in leather and cloth, in slipcase2000 unsigned cloth bound sets, in slipcase ","image":"http://stephenking.com/images/limited_edition/40/le_delux_hardcover_prop_embed.jpg","id":181},{"title":"The Green Mile: Coffey on the Mile","date":"August 1996","text":" The Green Mile: Coffey on the MileFormats: PaperbackFirst Edition Release Date:August, 1996Synopsis:The final chapter in this six-part novel tells us of John Coffey's fate.  The story also brings us to the present day story of Paul Edgecombe and learn of the consequences of his actions during his time on E Block with John Coffey.Notes:The individual books are no longer in print but are now available as a single volume. ","image":"http://stephenking.com/images/novel/43/paperback_prop_embed.jpg","id":182},{"title":"The Green Mile: Coffey's Hands","date":"May 1996","text":" The Green Mile: Coffey's HandsFormats: PaperbackFirst Edition Release Date:May, 1996Synopsis:Paul Edgecombe has been suffering with a bladder infection for some time that hasn't cleared.  It is in this book that Paul discovers that John Coffey can heal with his touch.  Eduard Delacroix has been teaching Mr. Jingles tricks and is quite attached to the mouse--almost as much as guard Percy Wetmore despises it.Notes:The individual installments are no longer in print but are available as a single volume. ","image":"http://stephenking.com/images/novel/40/paperback_prop_embed.jpg","id":183},{"title":"The Green Mile: Night Journey","date":"July 1996","text":" The Green Mile: Night JourneyFormats: PaperbackFirst Edition Release Date:July, 1996Synopsis:Prison Warden Hal Moores and his wife Melinda have also been Paul and Janice Edgecombe's friends.  When Paul learns that Melinda has a brain tumor, he decides to help but knows that the warden would never allow John Coffey to leave the prison and, obviously, Melinda could not go there.  He and the other guards from E Block take on a dangerous plan to spirit Coffey out during the night risking their jobs--not something to take lightly in 1932--and possibly their lives.Notes:The individual installments are no longer in print but are available as a single volume. ","image":"http://stephenking.com/images/novel/42/paperback_prop_embed.jpg","id":184},{"title":"The Green Mile: The Bad Death of Eduard Delacroix","date":"June 1996","text":" The Green Mile: The Bad Death of Eduard DelacroixFormats: PaperbackFirst Edition Release Date:June, 1996Synopsis:It is time for the execution of Eduard Delacroix and is Percy Wetmore's first opportunity to participate in an execution.  In this book we learn to what lengths Percy will go to get revenge on Eduard for having laughed at him. Notes:The individual installments are out of print but are available as a single volume. ","image":"http://stephenking.com/images/novel/41/paperback_prop_embed.jpg","id":185},{"title":"The Green Mile: The Complete Serial Novel","date":"December 1999","text":" The Green Mile: The Complete Serial NovelFormats: Hardcover / Paperback / Audio / Movie / DVDFirst Edition Release Date:2000Synopsis:They call death row at Cold Mountain Penitentiary “The Green Mile.” John Coffey, sentenced to die for the rape and murder of two young girls, is the latest addition to the Mile. Paul Edgecomb, the ward superintendent, discovers that there is more to John Coffey than meets the eye, for this friendly giant has the power to heal. Notes:This edition includes \"Foreword: A Letter\" by King and a new introduction by Stephen's agent, Ralph Vicinanza.  Frontispiece and six illustrations by Mark Geyer. ","image":"http://stephenking.com/images/novel/45/hardcover.jpg","id":186},{"title":"The Green Mile: The Mouse on the Mile","date":"April 1996","text":" The Green Mile: The Mouse on the MileFormats: PaperbackFirst Edition Release Date:April, 1996Synopsis:The story continues with the addition of two new characters,  one a new death row inmate--William \"Wild Bill\" Wharton.  The other, a mouse, called Steamboat Willy by the guards who first noticed him and later Mr. Jingles by Eduard Delacroix, one of the death row inmates who takes in the mouse and makes him his pet.Notes:The individual installments are no longer in print but are available as a single volume. ","image":"http://stephenking.com/images/novel/39/paperback_prop_embed.jpg","id":187},{"title":"The Green Mile: The Two Dead Girls","date":"March 1996","text":" The Green Mile: The Two Dead GirlsFormats: PaperbackFirst Edition Release Date:March, 1996Synopsis:The story is told by former prison guard, Paul Edgecombe, of events in Cold Mountain penitentiary during 1932 when an unusual inmate by the name of John Coffey is brought to the prison.  He and his fellow guards are assigned to watch inmates on death row, known as The Green Mile.  John Coffey has been convicted of murdering two young girls and sentenced to death but there's something about him that makes Paul question whether this man could have committed that crime. Notes:The individual installments are no longer in print but are available as a single volume. ","image":"http://stephenking.com/images/novel/34/paperback_prop_embed.jpg","id":188},{"title":"Grey Matter","date":"December 1977","text":" Grey MatterSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":189},{"title":"Hard Listening","date":"June 2013","text":" Hard ListeningFormats: ebookFirst Edition Release Date:June, 2013Edited By:Synopsis:In 1992, a cadre of the world’s bestselling authors formed a rock band called the Rock Bottom Remainders.  For two decades the band played proudly (and some would say, terribly) to sold out crowds across the country.  Now they’re hanging up their guitar picks, drumsticks and leather whips, but not without a look back at twenty years of friendship, love, writing, and the redemptive power of rock’n’roll.Hard Listeningis a voyeuristic view into the private lives of your favorite authors, combining essays, fiction, musings, candid email exchanges and conversations, compromising photographs, audio and video clips, and interactive quizzes for a groundbreaking ebook experience. ","image":"http://stephenking.com/images/nonfiction/other_authors/hard_listening_prop_embed.jpg","id":190},{"title":"The Hardcase Speaks","date":"April 2004","text":" The Hardcase SpeaksSynopsis: ","image":"http://stephenking.com/images/other_project/4/devils_wine.jpg","id":191},{"title":"Harrison State Park '68","date":"April 2004","text":" Harrison State Park '68Synopsis: ","image":"http://stephenking.com/images/other_project/4/devils_wine.jpg","id":192},{"title":"Harvey's Dream","date":"November 2008","text":" Harvey's DreamSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":193},{"title":"He is Legend","date":"March 2009","text":" He is LegendFormats: Hardcover / Limited Edition / AudiobookFirst Edition Release Date:March, 2009Edited By:Christopher ConlonSynopsis:Includes the short story, \"Throttle\", written by Stephen King and Joe Hill. ","image":"http://stephenking.com/images/anthology/36/he_is_legend007.jpg","id":194},{"title":"Head Down","date":"December 1990","text":" Head DownSynopsis:“Head Down” is a nonfiction essay that chronicles the 1989 season of his son Owen’s little league baseball team and all the triumphs and tribulations the team experiences on the road to the Maine State Championships.This is included in Nightmares & Dreamscapes. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":195},{"title":"Hearts in Atlantis","date":"September 1999","text":" Hearts in AtlantisFormats: Hardcover / Paperback / ebook / Kindle / AudioFirst Edition Release Date:September, 1999Synopsis:\"Low Men in Yellow Coats\"Bobby Garfield befriends an elderly gentleman, Ted Brautigan, who moves into the boarding house where he and his mother have lived since his father's death.  During the summer that follows, his friendship with Ted grows as he spends time reading the newspaper to him and is hired to be on the lookout for any signs for lost animals or strange cars that may be in the neighborhood.   Although he and his best friends, Carol Gerber and John \"Sully\" Sullivan begin to see these strange signs, Bobby neglects to tell Ted with dire consequences. ","image":"http://stephenking.com/images/books/hearts_in_atlantis/hardcover_prop_embed.jpg","id":196},{"title":"Hearts in Atlantis","date":"September 1999","text":" Hearts in AtlantisSynopsis:It's 1966 and the height of the Vietnam War when Pete Riley first comes to the University of Maine. Uppermost on the minds of many young men at that time is the draft. and maintaining their grade point average so that they would not be called by Selective Service. Despite this threat, a group becomes obsessed by a game called Hearts which puts them in danger of losing their deferred status as they neglect their studies. The story follows them during their first year and tells of how Pete Riley meets and falls in love with Carol Gerber who first appeared in Low Men in Yellow Coats. ","image":"http://stephenking.com/images/books/hearts_in_atlantis/hardcover_prop_embed.jpg","id":197},{"title":"Hearts in Suspension","date":"November 2016","text":" Hearts in SuspensionFormats: HardcoverFirst Edition Release Date:November, 2016Edited By:Jim BishopSynopsis:STEPHEN KING REMEMBERS A LOST ATLANTISThis publication marks the 50th anniversary of Stephen King’s entrance into the University of Maine at Orono in the fall of 1966. The accelerating war in Vietnam and great social upheaval at home exerted a profound impact on students of the period and deeply influenced King’s development as a writer and as a man.King’s fictional treatment of this experience in his novella “Hearts in Atlantis” (reprinted in this volume) tracks his youthful avatar, Peter Riley, through the awakenings and heartbreak of his turbulent first year at UMaine. In his accompanying essay, “Five to One, One in Five,” written expressly for this volume, King sheds his fictional persona and takes on the challenge of a nonfiction return to his undergraduate experience. The stereoscopic combination of these narratives, told with King’s characteristic blend of canny insight and self-deprecating humor, create a revealing portrait of the artist as young man and a ground-level tableau of this highly charged time.In addition, twelve fellow students and friends from King’s college days contribute personal narratives recalling their own experience of those years. These recollections—engaged, irreverent, and affecting—bring dimension and texture to the collective witnessing of a formative time in their lives and a defining moment in the country’s history.This book also includes four installments of King’s never-before-reprinted student newspaper column, “King’s Garbage Truck.” These lively examples of  King’s damn-the-torpedoes style, entertaining and shrewd in their youthful perceptions, more than hint at a talent about to take its place in the American literary landscape.A gallery of period photographs and documents augments this volume.373 pagesISBN 978-0-89101-127-9October 4th, 2016 Press Release from The University of Maine ","image":"http://stephenking.com/images/anthology/80/heartsinsuspension_cover.png.jpg","id":198},{"title":"Heavenly Shades of Night Are Falling","date":"September 1999","text":" Heavenly Shades of Night Are FallingSynopsis:The conclusion toHearts in Atlantis brings Bobby Garfield back to the house on Broad Street where he first met Ted Brautigan. It's been a hard life for Bobby since he left nearly 40 years before. The mystery is how circumstances conspired to bring him back to meet someone he thought he would never see again. ","image":"http://stephenking.com/images/books/hearts_in_atlantis/hardcover_prop_embed.jpg","id":199},{"title":"Here There Be Tygers","date":"June 1985","text":" Here There Be TygersSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":200},{"title":"Herman Wouk is Still Alive","date":"November 2015","text":" Herman Wouk is Still AliveSynopsis:After winning $2,700 on a lottery ticket, long-time friends Brenda and Jasmine rent a Chevy Express for a road trip back to their hometown along with their 7 children. Approaching from the opposite direction are two aging poets and former lovers who are on their way to a paid appearance at the University of Maine. The lives of all the characters soon intersect in a climatic ending. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":201},{"title":"Home Delivery","date":"December 1988","text":" Home DeliverySynopsis:Maddie Pace is a young, pregnant widow whose husband recently died in a fishing boat accident. When reanimated dead bodies start attacking the living, the only defense is to destroy the dead and burn the pieces. It isn’t long before Maddie must confront the zombie of her dead husband and decide if she is strong enough to watch him die all over again. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":202},{"title":"Horror Fiction: from Danse Macabre","date":"December 1999","text":" Horror Fiction: from Danse MacabreSynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":203},{"title":"The Horror Market Writer and the Ten Bears: A True Story","date":"December 1999","text":" The Horror Market Writer and the Ten Bears: A True StorySynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":204},{"title":"Horrors","date":"August 1981","text":" HorrorsFormats: PaperbackFirst Edition Release Date:August, 1981Edited By:Charles GrantSynopsis:Contains \"The Monkey\" ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":205},{"title":"The House on Maple Street","date":"October 1993","text":" The House on Maple StreetSynopsis:The four Bradbury children discover a mysterious entity slowly replacing the wood and plaster of their home with metal and machinery. Realizing that a cataclysmic event is on the horizon, they plan their own escape while using the opportunity to trap their hated and feared stepfather and be rid of him forever. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":206},{"title":"How IT Happened","date":"December 1999","text":" How IT HappenedSynopsis:Stephen tells how he came up with the idea to write IT. ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":207},{"title":"I Am the Doorway","date":"December 1977","text":" I Am the DoorwaySynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":208},{"title":"I Know What You Need","date":"December 1977","text":" I Know What You NeedSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":209},{"title":"I Shudder At Your Touch","date":"December 1990","text":" I Shudder At Your TouchFormats: Hardcover / PaperbackFirst Edition Release Date:1991Edited By:Michele SlungSynopsis:A sensational anthology of sex, horror, and the supernatural from 21 bestselling authors such as Stephen King, Clive Barker, Ruth Rendell, Stephen J. Donaldson, Patrick McGrath, and more.Contains short story \"The Revelations of 'Becka Paulson\". ","image":"http://stephenking.com/images/anthology/28/shudder.jpg","id":210},{"title":"IT","date":"September 1986","text":" ITFormats: Hardcover / Paperbook / TV Movie / DVDFirst Edition Release Date:September, 1986Synopsis:A promise made twenty-eight years ago calls seven adults to reunite in Derry, Maine, where as teenagers they battled an evil creature that preyed on the city's children. Unsure that their Losers Club had vanquished the creature all those years ago, the seven had vowed to return to Derry if IT should ever reappear. Now, children are being murdered again and their repressed memories of that summer return as they prepare to do battle with the monster lurking in Derry's sewers once more. ","image":"http://stephenking.com/images/books/it/hardcover_prop_embed.jpg","id":211},{"title":"In Sunlight or in Shadow: Stories Inspired by the Paintings of Edward Hopper","date":"December 2016","text":" In Sunlight or in Shadow: Stories Inspired by the Paintings of Edward HopperFormats: Hardcover, eBookFirst Edition Release Date:December, 2016Edited By:Lawrence BlockSynopsis:A newly-commissioned anthology of seventeen superbly-crafted stories inspired by the paintings of Edward Hopper, with original stories from Stephen King, Joyce Carol Oates, Robert Olen Butler, Michael Connelly, Megan Abbott, Craig Ferguson, Nicholas Christopher, Jill D. Block, Joe R. Lansdale, Justin Scott, Kris Nelscott, Warren Moore, Jonathan Santlofer, Jeffery Deaver, Lee Child, Gail Levin, and Lawrence Block himself. Each story is accompanied by a four-color reproduction of the painting that inspired it.  ","image":"http://stephenking.com/images/anthology/79/sunlightshadow.jpg","id":212},{"title":"In the Deathroom","date":"March 2002","text":" In the DeathroomSynopsis:A man named Fletcher is held captive in a South American stronghold.  His captors will use any tortuous means necessary to extract the information they want from him. His only hope lies with his last request--one last cigarette. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":213},{"title":"In the Key-Chords of Dawn","date":"April 2004","text":" In the Key-Chords of DawnSynopsis: ","image":"http://stephenking.com/images/other_project/4/devils_wine.jpg","id":214},{"title":"In the Shadow of the Master","date":"December 2008","text":" In the Shadow of the MasterFormats: Hardcover / PaperbackFirst Edition Release Date:2009Edited By:Michael ConnellySynopsis:A collection of sixteen of Edgar Allan Poe's tales accompanied by twenty essays from various authors. Includes Stephen's essay, The Genius of \"The Tell-Tale Heart\". ","image":"http://stephenking.com/images/anthology/62/in_shadow_of_the_master040.jpg","id":215},{"title":"In the Tall Grass","date":"December 1999","text":" In the Tall GrassSynopsis:In the Tall Grass begins with a sister and brother who pull off to the side of the road after hearing a young boy crying for help from beyond the tall grass. Within minutes they are disoriented, in deeper than seems possible, and they’ve lost one another. The boy’s cries are more and more desperate. What follows is a terrifying, entertaining, and masterfully told tale, as only Stephen and Joe can deliver.Originally, Esquire published \"In the Tall Grass\" as part of  \"Fiction for Men\" series in the summer of 2012. It was published in two parts, the first appeared  in the June/July issue and the conclusion in the August issue.          ","image":"http://stephenking.com/images/short_stories/in_the_tall_grass/prop_embed.jpg","id":216},{"title":"Insomnia","date":"December 1993","text":" InsomniaFormats: Hardcover / Paperback / Limited Edition / AudioFirst Edition Release Date:1994Synopsis:Since his wife died, Ralph Roberts has been having trouble sleeping. Each night he awakens a little earlier until he's barely sleeping at all. During his late night vigils and walks, he observes some strange things going on in Derry, Maine. He sees colored ribbons streaming from people's heads. He witnesses two strange little men wandering the city under cover of night. He begins to suspect that these visions are something more than hallucinations brought about by sleep deprivation. Ralph and his friend, widow Lois Chasse, become enmeshed in events of cosmic significance. ","image":"http://stephenking.com/images/books/insomnia/hardcover_prop_embed.jpg","id":217},{"title":"Insomnia","date":"June 1994","text":" InsomniaFormats: Formats: HardcoverFirst Edition Release Date: June, 1994Synopsis:Limited edition of 1,250 numbered copies, with dust jacket and traycase, signed by King, Hale, and FennerGift edition of 3,750 copies, with dust jacket and slipcase5 Artist copies; 3 \"mechanical copies\" for King, the publisher and the proofreader; indeterminate number of presentation copies ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":218},{"title":"Introduction to Jack Ketchum's The Girl Next Door","date":"December 1999","text":" Introduction to Jack Ketchum's The Girl Next DoorSynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":219},{"title":"Isaac Asimov's Magical World of Fantasy #4","date":"December 1984","text":" Isaac Asimov's Magical World of Fantasy #4Formats: PaperbackFirst Edition Release Date:1985Edited By:Isaac AsimovSynopsis:12 tales of magic worked for good or ill by Fritz Leiber, Ray Bradbury, Andre Norton, Jack Vance, Sir Arthur Conan Doyle and Stephen King, among others. Contains short story \"I Know What You Need\". ","image":"http://stephenking.com/images/anthology/29/isaac_asimovs_fantasy_4.jpg","id":220},{"title":"It Grows on You","date":"December 1981","text":" It Grows on YouSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":221},{"title":"The Jaunt","date":"June 1985","text":" The JauntSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":222},{"title":"Jerusalem's Lot","date":"December 1977","text":" Jerusalem's LotSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":223},{"title":"Joyland Illustrated Edition","date":"September 2015","text":" Joyland Illustrated EditionFormats: HardcoverFirst Edition Release Date:September, 2015Synopsis:After realizing his romantic life is not going in the direction he'd hoped, Devin Jones decides to take a summer job at an amusement park. There he makes friends with Tom Kennedy and Erin Cook, also summer hires at Joyland, which years before had been the scene of the murder of a young woman named Linda Gray whose ghost is said to be seen at the Horror House. He also befriends a young boy, named Mike Ross and his mother, Annie. Their lives all become entwined when Devin decides to investigate the mystery of Linda Gray's unsolved murder by the \"Carny Killer.\"Notes:The illustrated edition features a brand new cover painting by popular Hard Case Crime artist Glen Orbik, whose other covers for the series include books by Gore Vidal and Michael Crichton; a map of the Joyland amusement park illustrated in the classic ‘mapback’ style by Susan Hunt Yule; and more than twenty interior illustrations by acclaimed artists Robert McGinnis, Mark Summers and Pat Kinsella. ","image":"http://stephenking.com/images/limited_edition/joyland/illustrated/joyland_illustrated_prop_embed.png","id":224},{"title":"Joyland","date":"June 2013","text":" JoylandFormats: Formats: Hardcover / Limited EditionFirst Edition Release Date: June, 2013Synopsis:Signed, Limited EditionLettered, hardcover edition, presented in a black clam-shell box, bearing the Hard Case Crime logo in gold foil. Signed by Stephen King. Features 9 illustrations by master artist, Robert McGinnis, and a map of the Joyland amusement park, created especially for the limited editions by Susan Hunt Yule. Limited to 26 unitsSigned, Numbered EditionSigned by Stephen King, featuring nine illustrations from master artist Robert McGinnis and a map of the Joyland amusement park, created for especially for the hardcover limited editions by Susan Hunt Yule. Limited to 724 unitsStandard Limited EditionThis special edition of Joyland in hardcover is unsigned and limited to 1500 units worldwide. It features nine illustrations from master artist Robert McGinnis and a map of the Joyland amusement park, created for especially for the hardcover limited editions by Susan Hunt Yule. ","image":"http://stephenking.com/images/limited_edition/joyland/prop_embed.jpg","id":225},{"title":"Joyland","date":"June 2013","text":" JoylandFormats: Paperback / Limited Edition HardcoverFirst Edition Release Date:June, 2013Synopsis:After realizing his romantic life is not going in the direction he'd hoped, Devin Jones decides to take a summer job at an amusement park. There he makes friends with Tom Kennedy and Erin Cook, also summer hires at Joyland, which years before had been the scene of the murder of a young woman named Linda Gray whose ghost is said to be seen at the Horror House. He also befriends a young boy, named Mike Ross and his mother, Annie. Their lives all become entwined when Devin decides to investigate the mystery of Linda Gray's unsolved murder by the \"Carny Killer.\" ","image":"http://stephenking.com/images/books/joyland/joyland_property_embed.jpg","id":226},{"title":"Jumper","date":"December 1999","text":" JumperSynopsis:First written by Stephen at the age of 12 and self-published inDave's Rag, a community newspaper run by Stephen and his brother David. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":227},{"title":"Just A Little Talent","date":"June 2013","text":" Just A Little TalentSynopsis:Stephen writes about learning to play the guitar, his love of music, and talent. ","image":"http://stephenking.com/images/nonfiction/other_authors/hard_listening_prop_embed.jpg","id":228},{"title":"Just After Sunset","date":"November 2008","text":" Just After SunsetFormats: Hardcover / eBook / Kindle / Audio / PaperbackFirst Edition Release Date:November, 2008Synopsis:This is Stephen's fifth short story collection. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":229},{"title":"L.T.'s Theory of Pets","date":"March 2002","text":" L.T.'s Theory of PetsSynopsis:LT has a theory about pets, particularly his Siamese cat.  It had belonged to him and his wife until he came home one day to find a note on the fridge from his wife letting him know she'd left him, but left the cat. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":230},{"title":"The Langoliers","date":"September 1990","text":" The LangoliersSynopsis:A group of travelers on a red-eye flight from California to Maine wake up to discover that most of their fellow passengers have vanished mid-flight, along with the pilots and flight attendants. ","image":"http://stephenking.com/images/books/four_past_midnight/hardcover_prop_embed.jpg","id":231},{"title":"The Last Rung on the Ladder","date":"December 1977","text":" The Last Rung on the LadderSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":232},{"title":"The Lawnmower Man","date":"December 1977","text":" The Lawnmower ManSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":233},{"title":"The Ledge","date":"December 1977","text":" The LedgeSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":234},{"title":"Legends","date":"December 1997","text":" LegendsFormats: Hardcover / PaperbackFirst Edition Release Date:1998Edited By:Robert SilverbergSynopsis:Acclaimed writer and editor Robert Silverberg gathered eleven of the finest writers in Fantasy to contribute to this collection of short novels. Each of the writers was asked to write a new story based on one of his or her most famous series: from Stephen King's opening piece set in his popularGunslinger universe to Robert Jordan's early look at his famed Wheel of Timesaga, these stories are exceptionally well written and universally well told. The authors include King, Jordan, and Silverberg himself, as well as Terry and Lyn Pratchett, Terry Goodkind, Orson Scott Card, Ursula K. Le Guin, Tad Williams, George R.R. Martin, Anne McCaffrey, and Raymond E. Feist.Contains short story \"The Little Sisters of Eluria\". ","image":"http://stephenking.com/images/anthology/30/legends.hardcover.jpg","id":235},{"title":"Letters from Hell","date":"September 1988","text":" Letters from HellFormats: Formats: BroadsheetFirst Edition Release Date: September, 1988Synopsis:Limited edition of 500 copies, 18\" x 24\" broadsheet, printed in three colors, signed by King.26 Lettered (A-Z) copies, signed by King ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":236},{"title":"The Library Policeman","date":"September 1990","text":" The Library PolicemanSynopsis:When a man forgets to return some books he borrowed from the library while writing a speech, and later accidentally destroys them, the phantom librarian who lent him the books sends the library policemen to terrorize him ","image":"http://stephenking.com/images/books/four_past_midnight/hardcover_prop_embed.jpg","id":237},{"title":"Light Speed: Year One","date":"December 2010","text":" Light Speed: Year OneFormats: Trade PaperbackFirst Edition Release Date:2011Edited By:John Joseph AdamsSynopsis:Lightspeed: Year One compiles all the fiction published by the online science fiction magazine Lightspeedin its first year. Originally published stories include Nebula Award finalists Vylar Kaftan's \"I'm Alive, I Love You, I'll See You in Reno\" and Adam-Troy Castro's \"Arvies\" as well as Carrie Vaughn's Hugo Award-nominated \"Amaryllis\". Plus there are classic stories by Stephen King, Ursula K. Le Guin, George R. R. Martin, and more.Contains the short story \"Beachworld\". ","image":"http://stephenking.com/images/anthology/66/light_speed_year_one.jpg","id":238},{"title":"Lisey's Story","date":"October 2006","text":" Lisey's StoryFormats: Hardcover / Paperback / eBook / Kindle / AudioFirst Edition Release Date:October, 2006Synopsis:Two years after her husband's death, Lisey Landon decides it's time to go through his office to clear out his papers.  Scott Landon was a bestselling novelist and Lisey has been besieged by people wanting to buy any of his unpublished work but she is determined not to let that happen.  As she begins the process of cleaning, she is contacted by an unsavory character who claims that if she does not turn over the papers, he will make her suffer the consequences.  Finding strength she did not know she had and never used during their marriage, Lisey refuses, and true to his word, \"Zack McCool\" begins to stalk her.  Lisey begins to remember strange events from her marriage that she had suppressed and finds clues that may help save her life. ","image":"http://stephenking.comhttp://www.stephenking.com/images/books/liseys_story/hardcover_prop_embed.jpg","id":239},{"title":"Little Green God of Agony","date":"September 2011","text":" Little Green God of AgonySynopsis:Katherine \"Kat\" MacDonald is an RN hired to care for wealthy client, Andrew Newsome, who has gone from doctor to doctor trying to find a quick cure for his lingering pain to no avail. She is convinced that he would overcome the injuries he sustained in an airplane crash but he is unwilling to endure the pain of physical therapy. In desperation, Newsome has hired a healer, Reverend Rideout, who promises to \"expel\" his pain. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":240},{"title":"The Little Sisters of Eluria","date":"January 2009","text":" The Little Sisters of EluriaFormats: Formats: Hardcover Deluxe / Hardcover ArtistFirst Edition Release Date: January, 2009Synopsis:1,250 copies Deluxe edition numbered and signed by Stephen King and Michael Whelan4,000 copies Artist Edition numbered and signed by Michael Whelan ","image":"http://stephenking.com/images/limited_edition/46/little_sisters_limited.jpg","id":241},{"title":"The Little Sisters of Eluria","date":"December 1997","text":" The Little Sisters of EluriaSynopsis:Roland is a gunslinger in a deserted town when he gets ambushed. He ends up in a strange infirmary attended by the \"Little Sisters\" and wondering if he'll survive their care. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":242},{"title":"The Lonesome Death of Jordy Verrill","date":"December 1999","text":" The Lonesome Death of Jordy VerrillSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":243},{"title":"The Long Walk","date":"December 1978","text":" The Long WalkFormats: Paperback / AudioFirst Edition Release Date:1979Synopsis:In the near future, where America has become a police state, one hundred boys are selected to enter an annual contest where the winner will be awarded whatever he wants for the rest of his life. The game is simple - maintain a steady walking pace of four miles per hour without stopping. Three warnings, and you're out - permanently. ","image":"http://stephenking.com/images/books/long_walk/paperback_prop_embed.jpg","id":244},{"title":"Low Men in Yellow Coats","date":"September 1999","text":" Low Men in Yellow CoatsSynopsis:Bobby Garfield befriends an elderly gentleman, Ted Brautigan, who moves into the boarding house where he and his mother have lived since his father's death. During the summer that follows, his friendship with Ted grows as he spends time reading the newspaper to him and is hired to be on the lookout for any signs for lost animals or strange cars that may be in the neighborhood. Although he and his best friends, Carol Gerber and John \"Sully\" Sullivan begin to see these strange signs, Bobby neglects to tell Ted with dire consequences. ","image":"http://stephenking.com/images/books/hearts_in_atlantis/hardcover_prop_embed.jpg","id":245},{"title":"Luckey Quarter","date":"March 2002","text":" Luckey QuarterSynopsis:Darlene is a single mom struggling to raise two kids on her income as a chambermaid in Reno. When Room 322 leaves her a quarter for a tip, Darlene lets that quarter take her for a ride. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":246},{"title":"Lunch at the Gotham Cafe","date":"August 1996","text":" Lunch at the Gotham CafeSynopsis:Steve Davis is suffering through intense withdrawal--from both nicotine and his wife. His desperation for a cigarette and for his ex are almost too much to bear, but that's nothing compared to the horrors that await him at a trendy Manhattan restaurant.  ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":247},{"title":"Magicats","date":"December 1983","text":" MagicatsFormats: PaperbackFirst Edition Release Date:1984Edited By:Jack Dann and Gardner DozoisSynopsis:Eighteen Fabulous Feline Fantasies, paperback book edited by Jack Dann and Gardner Dozois.Contains the short story \"The Cat from Hell\". ","image":"http://stephenking.com/images/anthology/31/magicats.jpg","id":248},{"title":"The Mammoth Book of Body Horror","date":"March 2012","text":" The Mammoth Book of Body HorrorFormats: PaperbackFirst Edition Release Date:March, 2012Edited By:Edited by Paul Kane & Marie O?ReganSynopsis:Promotional Text from the Publisher: A very special and unique anthology celebrating the sub-genre of ‘Body Horror’, tracing its origins right up to the most modern exponents of the form. Featuring a veritable ‘who’s who’ of horror literature, and including the stories those classic Body Horror movies – The Thing, The Fly and Re-Animator – were based on, this promises to be a groundbreaking and landmark release in the history of the genre. Full Table of Contents below:TRANSFORMATION by Mary Shelley; THE TELL-TALE HEART by Edgar Allan Poe; HERBERT WEST: RE-ANIMATOR byH.P. Lovecraft; WHO GOES THERE?  John W. Campbell; THE FLY by George Langelaan; TIS THE SEASON TO BE JELLY by Richard Matheson;SURVIVOR TYPE by Stephen King;THE BODY POLITIC by Clive Barker; THE CHANEY LEGACY by Robert Bloch; THE OTHER SIDE by Ramsey Campbell; FRUITING BODIES by Brian Lumley; FREAKTENT by Nancy A. Collins; REGION OF THE FLESH by Richard Christian Matheson; WALKING WOUNDED by Michael Marshall Smith; CHANGES by Neil Gaiman; OTHERS by James Herbert; THE LOOK by Christopher Fowler; RESIDUE by Alice Henderson; DOG DAYS by Graham Masterton; BLACK BOX by Gemma Files; THE SOARING DEAD by Simon Clark; POLYP by Barbie Wilde; ALMOST FOREVER by David Moody; BUTTERFLY by Axelle Carolyn; STICKY EYE by Conrad Williams.Introduction by Stuart Gordon (Director of Re-Animator and From Beyond) ","image":"http://stephenking.com/images/anthology/mammoth_book_of_body_horror/mammoth_book_of_body_horror_prop_embed.jpg","id":249},{"title":"The Man Who Loved Flowers","date":"December 1977","text":" The Man Who Loved FlowersSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":250},{"title":"The Man Who Would Not Shake Hands","date":"June 1985","text":" The Man Who Would Not Shake HandsSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":251},{"title":"The Man in the Black Suit","date":"December 1994","text":" The Man in the Black SuitSynopsis:A haunting recollection of a mysterious boyhood event. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":252},{"title":"The Mangler","date":"December 1977","text":" The ManglerSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":253},{"title":"Masques II","date":"June 1987","text":" Masques IIFormats: HardcoverFirst Edition Release Date:June, 1987Edited By:J. N. WilliamsonSynopsis:Collection of short stories by various authors including King, William F. Nolan, Robert Bloch, Richard Matheson et al.Contains the short story \"Popsy\". ","image":"http://stephenking.com/images/anthology/32/masques_ii.jpg","id":254},{"title":"McSweeney's Mammoth Treasury of Thrilling Tales","date":"February 2003","text":" McSweeney's Mammoth Treasury of Thrilling TalesFormats: PaperbackFirst Edition Release Date:February, 2003Edited By:Michael ChabonSynopsis:Collection of short stories by various authors including King, Elmore Leonard, Neil Gaiman, Michael Crichton et al.Contains the short story \"The Tale of Gray Dick\". ","image":"http://stephenking.com/images/anthology/2/mcsweeneystreasury.1.jpg","id":255},{"title":"Mid-Life Confidential: The Rock Bottom Remainders Tour America With Three Chords and an Attitude","date":"December 1993","text":" Mid-Life Confidential: The Rock Bottom Remainders Tour America With Three Chords and an AttitudeFormats: HardcoverFirst Edition Release Date:1994Synopsis:This is a compilation of anecdotes by the members (at the time) of The Rock Bottom Remainders about their first \"tour\" together in their alter-ego roles as a rock and roll band. Also included are 100 photographs taken by Tabitha King. Chapters are written by:Dave BarryTad BartimusRoy Blount, Jr.Michael DorrisRobert FulghumKathi Kamen GoldmarkMatt GroeningStephen KingTabitha KingBarbara KingsolverAl KooperGreil MarcusDave MarshRidley PearsonJoel SelvinAmy Tan ","image":"http://stephenking.com/images/nonfiction/5/hardcover_prop_embed.jpg","id":256},{"title":"Midnight Graffiti","date":"October 1992","text":" Midnight GraffitiFormats: HardcoverFirst Edition Release Date:October, 1992Edited By:James Van Hise and Jessie HorstingSynopsis:A collection of new horror stories includes contributions by Stephen King, Harlan Ellison, Dan Simmons, David J. Schow, Nancy Collins, and others.Contains the short story \"Rainy Season\". ","image":"http://stephenking.com/images/anthology/33/midnightgraffiti.jpg","id":257},{"title":"Mile 81","date":"November 2015","text":" Mile 81Synopsis:At Mile 81 on the Maine Turnpike is a boarded up rest stop, a place where high school kids drink and get into the kind of trouble high school kids have always gotten into. It’s the place where Pete Simmons goes when his older brother, who’s supposed to be looking out for him, heads off to the gravel pit to play “paratroopers over the side.”Pete, armed only with the magnifying glass he got for his tenth birthday, finds a discarded bottle of vodka in the boarded up burger shack and drinks enough to pass out.Not much later, a mud-covered station wagon (which is strange because there hadn’t been any rain in New England for over a week) veers into the Mile 81 rest area, ignoring the sign that says “closed, no services.” The driver’s door opens but nobody gets out.Doug Clayton, an insurance man from Bangor, is driving his Prius to a conference in Portland. On the backseat are his briefcase and suitcase and in the passenger bucket is a King James Bible, what Doug calls “the ultimate insurance manual,” but it isn’t going to save Doug when he decides to be the Good Samaritan and help the guy in the broken down wagon. He pulls up behind it, puts on his four-ways, and then notices that the wagon has no plates.Ten minutes later, Julianne Vernon, pulling a horse trailer, spots the Prius and the wagon, and pulls over. Julianne finds Doug Clayton’s cracked cell phone near the wagon door – and gets too close herself. By the time Pete Simmons wakes up from his vodka nap, there are a half a dozen cars at the Mile 81 rest stop. Two kids – Rachel and Blake Lussier –and one horse named Deedee are the only living left. Unless you maybe count the wagon. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":258},{"title":"Misery","date":"June 1987","text":" MiseryFormats: Hardcover / Paperback / Movie / DVDFirst Edition Release Date:June, 1987Synopsis:Novelist Paul Sheldon has plans to make the difficult transition from writing historical romances featuring heroine Misery Chastain to publishing literary fiction. Annie Wilkes, Sheldon's number one fan, rescues the author from the scene of a car accident. The former nurse takes care of him in her remote house, but becomes irate when she discovers that the author has killed Misery off in his latest book. Annie keeps Sheldon prisoner while forcing him to write a book that brings Misery back to life. ","image":"http://stephenking.com/images/books/misery/hardcover_prop_embed.jpg","id":259},{"title":"The Mist","date":"December 1979","text":" The MistSynopsis:David Drayton, his son Billy, and their neighbor Brent Norton head to the local grocery store to replenish supplies following a freak storm. Once there, they and other local citizens are trapped by a strange mist that has enveloped the town and in which strange creatures are lurking. As the mist takes its toll on the nerves of those trapped in the store, a religious zealot, Mrs. Carmody begins to play on their fears to convince them that this is God’s vengeance for their sins and that a sacrifice must be made and two groups—those for and those against—are aligned. When it is realized that staying in the store may prove fatal, a small group including the Draytons, store employee Ollie Weeks, Amanda Dumfries, Irene Reppler, and Dan Miller attempt to make their escape. They find that what’s “out there” may be worse than what they left behind. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":260},{"title":"Mister Yummy","date":"November 2015","text":" Mister YummySynopsis: ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":261},{"title":"Modern Masters of Horror","date":"July 1981","text":" Modern Masters of HorrorFormats: Hardcover / PaperbackFirst Edition Release Date:July, 1981Edited By:Frank CoffeySynopsis:15 chilling tales of the occult by such masters as Stephen King, John Coyne, George Romero, Jere CunninghamContains the short story \"The Monkey\". ","image":"http://stephenking.com/images/anthology/34/modern_masters_of_horror.jpg","id":262},{"title":"The Monkey","date":"December 1980","text":" The MonkeySynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":263},{"title":"Morality","date":"November 2015","text":" MoralitySynopsis:Chad, an aspiring writer who is teaching school until he lands a publishing contract, and his wife, Nora, who is working as a home nurse for a retired minister are, like most people these days, struggling financially.  Nora is approached by her employer with a proposition that could make their dream of a home in Vermont a reality.  But will it be worth the moral consequences?  ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":264},{"title":"More Tales of Unknown Horror","date":"December 1978","text":" More Tales of Unknown HorrorFormats: PaperbackFirst Edition Release Date:1979Edited By:Peter HainingSynopsis:Collection of short stories by various authorsContains \"The Night of the Tiger\" ","image":"http://stephenking.com/images/anthology/47/more_tales_of_unknown_horror.jpg","id":265},{"title":"Morning Deliveries (Milkman #1)","date":"June 1985","text":" Morning Deliveries (Milkman #1)Synopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":266},{"title":"Most Overrated Rock Band","date":"December 1999","text":" Most Overrated Rock BandSynopsis:Stephen's thoughts on The Beatles whom he feels is the most overrated rock band. Published in American Heritage Overrated Underrated, published in 2001 ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":267},{"title":"Mostly Old Men","date":"December 1999","text":" Mostly Old MenSynopsis:First published in Tin House Issue #40, August 2009 ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":268},{"title":"The Moving Finger","date":"October 1993","text":" The Moving FingerSynopsis:Howard Mitla is stunned at the sudden appearance of a solitary human finger poking out of the drain in his apartment’s bathroom sink. Afraid that the finger may attack him, Howard tries everything imaginable to get rid of it, from heavy-duty drain-cleaner to chopping it off. But what plagues Howard most is the thought of what, or whom, that finger is attached to. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":269},{"title":"Mr. Mercedes","date":"June 2014","text":" Mr. MercedesFormats: Hard CoverFirst Edition Release Date:June, 2014Synopsis:In the frigid pre-dawn hours, in a distressed Midwestern city, hundreds of desperate unemployed folks are lined up for a spot at a job fair. Without warning, a lone driver plows through the crowd in a stolen Mercedes, running over the innocent, backing up, and charging again. Eight people are killed; fifteen are wounded. The killer escapes.Mr. Mercedes is a war between good and evil, from the master of suspense whose insight into the mind of this obsessed, insane killer is chilling and unforgettable.Cover Reveal Page  ","image":"http://stephenking.com/images/books/mr_mercedes/mr_mecedes_prop_embed.jpg","id":270},{"title":"Mrs. Todd's Shortcut","date":"June 1985","text":" Mrs. Todd's ShortcutSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":271},{"title":"The Music Room","date":"December 2016","text":" The Music RoomSynopsis:In the days of the Great Depression the Enderbys had work, which was a blessing in a year when men were still standing in breadlines. ","image":"http://stephenking.com/images/anthology/79/sunlightshadow.jpg","id":272},{"title":"Mute","date":"November 2008","text":" MuteSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":273},{"title":"My Pretty Pony (Trade Edition)","date":"September 1989","text":" My Pretty Pony (Trade Edition)Formats: Formats: Trade PaperbackFirst Edition Release Date: September, 1989Synopsis:Oversized hardcover with slipcase15,000 copies, unsigned ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":274},{"title":"My Pretty Pony","date":"December 1987","text":" My Pretty PonyFormats: Formats: HardcoverFirst Edition Release Date: 1988Synopsis:Bound in stainless steel jacket with digital clock insetLimited printing of 250 copies, 150 of which were offered for sale, 100 were reserved for the museum's private collection and patrons of the museum, signed by both King and Kruger.30 copies, roman numerated I-XXX, designated \"artist's edition\" ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":275},{"title":"My Pretty Pony","date":"October 1993","text":" My Pretty PonySynopsis:An elderly man on his deathbed gives his young grandson a pocketwatch and warns the boy against the dangers of letting time slip away. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":276},{"title":"N.","date":"November 2008","text":" N.Synopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":277},{"title":"Needful Things","date":"December 1990","text":" Needful ThingsFormats: Hardcover / Paperback / Audio / Movie / DVDFirst Edition Release Date:1991Synopsis:Leland Gaunt opens a new shop in Castle Rock called Needful Things. Anyone who enters his store finds the object of his or her lifelong dreams and desires: a prized baseball card, a healing amulet. In addition to a token payment, Gaunt requests that each person perform a little \"deed,\" usually a seemingly innocent prank played on someone else from town. These practical jokes cascade out of control and soon the entire town is doing battle with itself. Only Sheriff Alan Pangborn suspects that Gaunt is behind the population's increasingly violent behavior. ","image":"http://stephenking.com/images/books/needfull_things/hardcover_prop_embed.jpg","id":278},{"title":"New Adventures of Sherlock Holmes","date":"December 1985","text":" New Adventures of Sherlock HolmesFormats: PaperbackFirst Edition Release Date:1986Edited By:Synopsis:Bestselling author Anne Perry and Conan Doyle's most recent biographer, Daniel Stashower, among others, contribute new stories that expand this tribute to Conan Doyle's immortal creation. Mystery editors Martin Greenberg and Carol-Lynn R\"ssel Waugh specially commissioned original works by Stephen King, Michael Gilbert, John Lutz, Edward D. Hoch, Dorothy B. Hughes, Peter Lovesey, Lillian de la Torre, John Gardner, and others for the first edition.Contains the short story \"The Doctor's Case\" ","image":"http://stephenking.com/images/anthology/48/new_adventures_of_sherlock_holmes.jpg","id":279},{"title":"The New Lieutenant's Rap","date":"April 1999","text":" The New Lieutenant's RapFormats: Formats: PaperbackFirst Edition Release Date: April, 1999Synopsis:500 numbered copies, signed by King.This was not originally intended for sale. It was a gift to attendees at Stephen's 25th publishing anniversary party at Tavern on the Green in New York city. ","image":"http://stephenking.com/images/limited_edition/29/new_lieut._rap037.jpg","id":280},{"title":"New Tales of the Cthulhu Mythos","date":"December 1979","text":" New Tales of the Cthulhu MythosFormats: PaperbackFirst Edition Release Date:1980Edited By:Ramsey CampbellSynopsis:Contains \"Crouch End\" ","image":"http://stephenking.com/images/anthology/49/new_tales_cthulhu_mythos.jpg","id":281},{"title":"New Terrors Omnibus","date":"July 1985","text":" New Terrors OmnibusFormats: PaperbackFirst Edition Release Date:July, 1985Edited By:Ramsey CampbellSynopsis:Includes \"Big Wheels\" ","image":"http://stephenking.com/images/anthology/41/terrors.jpg","id":282},{"title":"The New York Times at Special Bargain Rates","date":"November 2008","text":" The New York Times at Special Bargain RatesSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":283},{"title":"The Night Flier","date":"June 1988","text":" The Night FlierSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":284},{"title":"Night Shift","date":"December 1977","text":" Night ShiftFormats: Hardcover / Paperback / Kindle / AudioFirst Edition Release Date:1978Synopsis: ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":285},{"title":"Night Surf","date":"December 1977","text":" Night SurfSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":286},{"title":"Night Visions 5","date":"December 1987","text":" Night Visions 5Formats: HardcoverFirst Edition Release Date:1988Edited By:Douglas E. WinterSynopsis:Includes:  \"The Reploids\", \"Sneakers\", and \"Dedication\" ","image":"http://stephenking.com/images/anthology/43/night_visions_5032.jpg","id":287},{"title":"The Night of the Tiger","date":"December 1978","text":" The Night of the TigerSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/anthology/47/more_tales_of_unknown_horror.jpg","id":288},{"title":"Nightmares & Dreamscapes","date":"October 1993","text":" Nightmares & DreamscapesFormats: Hardcover / Paperback / AudioFirst Edition Release Date:October, 1993Synopsis: ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":289},{"title":"Nightmares in the Sky","date":"December 1987","text":" Nightmares in the SkyFormats: HardcoverFirst Edition Release Date:1988Synopsis:This is a coffee table book with 100 duotone and 24 full-color photographs of gargoyles and Gothic architecture by f-stop Fitzgerald with text by King. ","image":"http://stephenking.com/images/nonfiction/6/nightmaresinthesky.jpg","id":290},{"title":"Nightmares","date":"December 1978","text":" NightmaresFormats: PaperbackFirst Edition Release Date:1979Edited By:Charles L. GrantSynopsis:Contains \"Suffer the Little Children\" ","image":"http://stephenking.com/images/anthology/50/nightmares.jpg","id":291},{"title":"Nona","date":"December 1980","text":" NonaSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":292},{"title":"N","date":"December 1999","text":" NSynopsis: ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":293},{"title":"Obits","date":"November 2015","text":" ObitsSynopsis: ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":294},{"title":"The Old Dude's Ticker","date":"December 1999","text":" The Old Dude's TickerSynopsis:Vietnam veteran Richard Drogan, plagued by supersensitive hearing following his tour of duty there, is driven to the murder of his roommate who he refers to as the Old Dude. The story is an homage to Poe's storyThe Tell-Tale Heart. ","image":"http://stephenking.com/images/short_story/118/necon_xx_cover.jpg","id":295},{"title":"On Becoming a Brand Name","date":"June 1984","text":" On Becoming a Brand NameSynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":296},{"title":"On The Shining and Other Perpetrations","date":"December 1999","text":" On The Shining and Other PerpetrationsSynopsis:King discusses the genesis for The Shining and It Grows on You ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":297},{"title":"On Writing: A Memoir of the Craft","date":"December 1999","text":" On Writing: A Memoir of the CraftFormats: HardcoverFirst Edition Release Date:2000Synopsis:On Writing is both a textbook for writers and a memoir of Stephen's life and will, thus, appeal even to those who are not aspiring writers. If you've always wondered what led Steve to become a writer and how he came to be the success he is today, this will answer those questions. ","image":"http://stephenking.com/images/books/on_writing/hardcover_prop_embed.jpg","id":298},{"title":"One for the Road","date":"December 1977","text":" One for the RoadSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":299},{"title":"Paranoid: A Chant","date":"June 1985","text":" Paranoid: A ChantSynopsis: ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":300},{"title":"Pet Sematary","date":"December 1982","text":" Pet SemataryFormats: Hardcover / Paperback / Trade Paperback / Audio / Movie / DVDFirst Edition Release Date:1983Synopsis:The road in front of Dr. Louis Creed's rural Maine home frequently claims the lives of neighborhood pets. Louis has recently moved from Chicago to Ludlow with his wife Rachel, their children and pet cat. Near their house, local children have created a cemetery for the dogs and cats killed by the steady stream of transports on the busy highway. Deeper in the woods lies another graveyard, an ancient Indian burial ground whose sinister properties Louis discovers when the family cat is killed. ","image":"http://stephenking.com/images/books/pet_sematary/hardcover_prop_embed.jpg","id":301},{"title":"Peter Straub: An Informal Appreciation","date":"December 1999","text":" Peter Straub: An Informal AppreciationSynopsis:Non-fiction piece about Peter Straub ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":302},{"title":"The Plant [Installment One]","date":"November 1982","text":" The Plant [Installment One]Formats: Formats: Paperback / eBookFirst Edition Release Date: November, 1982Synopsis:200 numbered copies,signed by the author. These were intended for private distribution as a Christmas card/gift, not originally for sale.26 lettered copies, signed by the author. Also intended for private distribution only, not originally for sale. ","image":"http://stephenking.com/images/limited_edition/7/online_prop_embed.jpg","id":303},{"title":"The Plant [Installment Three]","date":"December 1984","text":" The Plant [Installment Three]Formats: Formats: PaperbackFirst Edition Release Date: 1985Synopsis:Limited edition of 200 numbered copies, signed by King. These were intended for private distribution and were not originally offered for sale.Limited edition of 26 lettered copies, signed by King. These were intended for private distribution and were not originally offered for sale. ","image":"http://stephenking.com/images/limited_edition/44/the_plant_part_3.jpg","id":304},{"title":"The Plant [Installment Two]","date":"December 1982","text":" The Plant [Installment Two]Formats: Formats: HardcoverFirst Edition Release Date: 1983Synopsis:200 numbered copies, signed by the author. These were intended for private distribution as a Christmas card/gift, not originally for sale.26 lettered copies, signed by the author. Also intended for private distribution only, not originally for sale. ","image":"http://stephenking.com/images/limited_edition/8/the_plant_part_2.jpg","id":305},{"title":"Popsy","date":"June 1987","text":" PopsySynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":306},{"title":"PostScripts","date":"February 2009","text":" PostScriptsFormats: PaperbackFirst Edition Release Date:February, 2009Edited By:Peter CrowtherSynopsis:Special BSFA Members Sampler EditionContains short story \"Graduation Afternoon\" ","image":"http://stephenking.com/images/anthology/40/postscripts.graduation_afternoon.jpg","id":307},{"title":"Premium Harmony","date":"November 2015","text":" Premium HarmonySynopsis:Ray and Mary Burkett's marriage is one of near constant bickering. During a trip to buy a present for her niece, Mary goes into the store while Ray and their dog wait in the car. Ray is called into the store when Mary has a heart attack and ultimately dies. When Ray returns to the car, he finds their dog has also died. The story is told in third person and the reader learns about Ray's true character through his thoughts. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":308},{"title":"Prime Evil","date":"June 1988","text":" Prime EvilFormats: HardcoverFirst Edition Release Date:June, 1988Edited By:Douglas E. WinterSynopsis:includes The Night Flier ","image":"http://stephenking.com/images/anthology/4/primeevilhardcover.jpg","id":309},{"title":"Quitter's Inc.","date":"December 1977","text":" Quitter's Inc.Synopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":310},{"title":"The Raft","date":"June 1985","text":" The RaftSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":311},{"title":"Rage","date":"December 1976","text":" RageFormats: PaperbackFirst Edition Release Date:1977Synopsis:A disturbed high-school student with authority problems kills one of his teachers and takes the rest of his class hostage. Over the course of one long, tense and unbearable hot afternoon, Charlie Decker explains what led him to this drastic sequence of events, while at the same time deconstructing the personalities of his classmates, forcing each one to justify his or her existence.Notes:No future printings will be made of this novel at Stephen's request due to the sensitive nature of the content. ","image":"http://stephenking.com/images/books/rage/paperback_prop_embed.jpg","id":312},{"title":"Rainy Season","date":"October 1992","text":" Rainy SeasonSynopsis:A husband and wife come to Willow, Maine and will stay, despite protests from the locals, to become sacrifices during the rainy season. When the “rain” starts, the couple must win the ultimate battle of Man vs. Nature if they have any hope of making it out alive. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":313},{"title":"The Reach","date":"June 1985","text":" The ReachSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":314},{"title":"The Reaper's Image","date":"June 1985","text":" The Reaper's ImageSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":315},{"title":"The Regulators","date":"December 1995","text":" The RegulatorsFormats: HardcoverFirst Edition Release Date:1996Synopsis:The peaceful suburban life on Poplar Street in Wentworth, Ohio is shattered one fine day when four vans containing shotgun-wielding \"regulators\" terrorize the street's residents, cold-bloodedly killing anyone foolish enough to venture outdoors. Houses mysteriously transform into log cabins and the street now ends in what looks like a child's hand-drawn western landscape. Masterminding this sudden onslaught is the evil creature Tak, who has taken over the body of an autistic boy whose parents were killed in a drive-by shooting several months earlier. ","image":"http://stephenking.com/images/books/regulators/hardcover_prop_embed.jpg","id":316},{"title":"The Regulators","date":"December 1995","text":" The RegulatorsFormats: Formats: HardcoverFirst Edition Release Date: 1996Synopsis:Limited edition of 500 numbered copies, boxed in \"MotoKops 2200 Power Wagon\" toy boxes. Signed and numbered by King as Richard Bachman on fake checks.Limited edition of 52 lettered copies, bound in leather with spent bullet cartridges embedded in binding, boxed in a wooden box. Signed and numbered by King as Richard Bachman on fake checks.30 copies designated Publisher's Copy. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":317},{"title":"Rest Stop","date":"November 2008","text":" Rest StopSynopsis:Author John Dykstra, who writes under the pen name of Rick Hardin, has had too much beer to drink at his mystery writer's group meeting and desperately needs to find a rest stop on his return from Jacksonville to Sarasota. There is only one other car at the rest stop and he hears its occupants in the Ladies' Room. It is a woman's and aman'svoice he hears coming from the bathroom and clearly the sounds of domestic abuse. John Dykstra has to decide how, or even if, he will act to stop it. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":318},{"title":"The Revelations of 'Becka Paulson","date":"December 1990","text":" The Revelations of 'Becka PaulsonSynopsis:'Becka Paulson is receiving messages--\"revelations\"--from a 3-D picture of Jesus which sits atop her television about her husband Joe's infidelity. ","image":"http://stephenking.com/images/anthology/28/shudder.jpg","id":319},{"title":"Revival","date":"November 2014","text":" RevivalFormats: Hardcover / Audiobook / eBookFirst Edition Release Date:November, 2014Synopsis:A dark and electrifying novel about addiction, fanaticism, and what might exist on the other side of life.In a small New England town, over half a century ago, a shadow falls over a small boy playing with his toy soldiers. Jamie Morton looks up to see a striking man, the new minister. Charles Jacobs, along with his beautiful wife, will transform the local church. The men and boys are all a bit in love with Mrs. Jacobs; the women and girls feel the same about Reverend Jacobs—including Jamie’s mother and beloved sister, Claire. With Jamie, the Reverend shares a deeper bond based on a secret obsession. When tragedy strikes the Jacobs family, this charismatic preacher curses God, mocks all religious belief, and is banished from the shocked town.Jamie has demons of his own. Wed to his guitar from the age of 13, he plays in bands across the country, living the nomadic lifestyle of bar-band rock and roll while fleeing from his family’s horrific loss. In his mid-thirties—addicted to heroin, stranded, desperate—Jamie meets Charles Jacobs again, with profound consequences for both men. Their bond becomes a pact beyond even the Devil’s devising, and Jamie discovers thatrevival has many meanings.This rich and disturbing novel spans five decades on its way to the most terrifying conclusion Stephen King has ever written. It’s a masterpiece from King, in the great American tradition of Frank Norris, Nathaniel Hawthorne, and Edgar Allan Poe. ","image":"http://stephenking.com/images/books/revival/revival_prop_embed.jpg","id":320},{"title":"Riding the Bullet","date":"March 2002","text":" Riding the BulletSynopsis:When he gets a call that his mother has suffered a stroke, college student, Alan Parker, has no car to get him from the University of Maine campus to Lewiston where she has been hospitalized.  He is able to hitch a ride with a stranger who offers him a no-win choice. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":321},{"title":"The Ring","date":"December 1999","text":" The RingSynopsis:Stephen recalls his wedding day and the meaning their wedding rings hold for them. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":322},{"title":"Rita Hayworth and Shawshank Redemption","date":"August 1982","text":" Rita Hayworth and Shawshank RedemptionSynopsis:Rita Hayworth and Shawshank Redemption--the most satisfying tale of unjust imprisonment and offbeat escape since The Count of Monte Cristo. ","image":"http://stephenking.com/images/books/different_seasons/hardcover_prop_embed.jpg","id":323},{"title":"The Road Virus Heads North","date":"March 2002","text":" The Road Virus Heads NorthSynopsis:Richard Kinnell buys a creepy painting at a yard sale which was painted by a metal-head neighbor of the woman running the yard sale just before he committed suicide. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":324},{"title":"Roadwork","date":"December 1980","text":" RoadworkFormats: Paperback / AudioFirst Edition Release Date:1981Synopsis:Barton Dawes’ unremarkable but comfortable existence suddenly takes a turn for the worst. Highway construction puts him out of work and simultaneously forces him out of his home. Dawes isn’t the sort of man who will take an insult of this magnitude lying down. His single-minded determination to fight the inevitable course of progress drives his wife and friends away while he tries to face down the uncaring bureaucracy that has destroyed his once comfortable life. ","image":"http://stephenking.com/images/books/roadwork/paperback_prop_embed.jpg","id":325},{"title":"Rose Madder","date":"December 1994","text":" Rose MadderFormats: Formats: HardcoverFirst Edition Release Date: 1995Synopsis:Limited edition of 250 numbered copies, signed by King on a bookplate, with slipcase ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":326},{"title":"Rose Madder","date":"December 1994","text":" Rose MadderFormats: Hardcover / Paperback / AudioFirst Edition Release Date:1995Synopsis:Rosie Daniels flees from her husband, Norman after fourteen years in an abusive marriage. During one bout of violence, Norman caused Rosie to miscarry their only child. Escaping to a distant city, Rosie establishes a new life and forges new relationships. Norman Daniels, a police officer with a reputation for cruelty, uses his law-enforcement connections to track his wayward wife.  ","image":"http://stephenking.comhttp://www.stephenking.com/images/books/rose_madder/hardcover_prop_embed.jpg","id":327},{"title":"The Running Man","date":"December 1981","text":" The Running ManFormats: Paperback / AudioFirst Edition Release Date:1982Synopsis:It is 2025 and reality TV has progressed to the point where people are willing to wager their lives in exchange for a chance at enormous wealth. Ben Richards is desperate - he needs money to treat his daughter's illness. His last chance is entering a game show called The Running Man where the objective is to elude police and specially trained trackers for a month. The reward is a cool billion dollars. The catch is that everyone else on the planet is watching and willing to turn him in for a reward. ","image":"http://stephenking.com/images/books/running_man/hardcover_prop_embed.jpg","id":328},{"title":"Rush Call","date":"December 1999","text":" Rush CallSynopsis:First written by Stephen at the age of 12 and self-published inDave's Rag, a community newspaper run by Stephen and his brother David. ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":329},{"title":"SCREEM #22","date":"April 2011","text":" SCREEM #22Synopsis: ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":330},{"title":"Secret Window, Secret Garden","date":"September 1990","text":" Secret Window, Secret GardenSynopsis:A man accuses author Mort Rainey of stealing one of his story ideas. Rainey, who is going through an ugly divorce, attempts to prove to his accuser that his own story was published first, but all evidence to support his argument begins to disappear, along with the people who might confirm his case. ","image":"http://stephenking.com/images/books/four_past_midnight/hardcover_prop_embed.jpg","id":331},{"title":"Secret Windows: Essays and Fiction on the Craft of Writing","date":"December 1999","text":" Secret Windows: Essays and Fiction on the Craft of WritingFormats: HardcoverFirst Edition Release Date:2000Synopsis:Secret Windows: Essays and Fiction on the Craft of Writing is an exclusive Book-of-the-Month Club anthology of hard-to-find non-fiction pieces, little-known interviews, short stories, and articles about writing. It includes an Introduction by Peter Straub. ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":332},{"title":"The Secretary of Dreams, Vol. 1","date":"December 2005","text":" The Secretary of Dreams, Vol. 1Formats: Formats: HardcoverFirst Edition Release Date: 2006Synopsis:Deluxe Lettered Edition of 52 copies, in a deluxe traycase, signed by King and ChadbourneLimited Edition of 750 copies, in traycase, signed by King and ChadbourneSlipcased Gift Edition of 5,000 copies, unsigned ","image":"http://stephenking.com/images/limited_edition/39/le_hardcover_prop_embed.jpg","id":333},{"title":"The Secretary of Dreams, Vol. 2","date":"October 2010","text":" The Secretary of Dreams, Vol. 2Formats: Formats: Hardcover Limited & Gift EditionsFirst Edition Release Date: October, 2010Synopsis:ISBN 978-1-58767-185-2 ","image":"http://stephenking.comhttp://www.stephenking.com/images/books/secretary_of_dreams_vol_II/secretary_of_dreams_vol_II_property_embed.jpg","id":334},{"title":"Shadows 4","date":"December 1999","text":" Shadows 4Formats: PaperbackFirst Edition Release Date:0Edited By:Charles L. GrantSynopsis:Contains \"The Man Who Would Not Shake Hands\" ","image":"http://stephenking.com/images/anthology/52/shadows_4.jpg","id":335},{"title":"Shadows","date":"December 1980","text":" ShadowsFormats: PaperbackFirst Edition Release Date:1981Edited By:Charles L. GrantSynopsis:Contains \"Nona\" ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":336},{"title":"The Shining","date":"December 2012","text":" The ShiningFormats: Formats: HardcoverFirst Edition Release Date: 2013Synopsis:Shipping in the fall of 2013, The Shining Limited Editon hardcovers from Subterranean Press will be published in three formats and will feature over 40 illustrations by acclaimed artist Gabriel Rodriguez. The signed editions will be signed by Stephen and the artist.More Information ","image":"http://stephenking.com/images/limited_edition/the_shining/the_shining_property_embed.jpg","id":337},{"title":"The Shining","date":"December 1976","text":" The ShiningFormats: Hardcover / Paperback / Trade / Kindle / Audio / Movie / TV Miniseries / DVDFirst Edition Release Date:1977Synopsis:Jack Torrance, his wife Wendy, and their young son Danny move into the Overlook Hotel, where Jack has been hired as the winter caretaker. Cut off from civilization for months, Jack hopes to battle alcoholism and uncontrolled rage while writing a play. Evil forces residing in the Overlook – which has a long and violent history – covet young Danny for his precognitive powers and exploit Jack’s weaknesses to try to claim the boy. ","image":"http://stephenking.com/images/books/shining/hardcover_prop_embed.jpg","id":338},{"title":"Shivers VII","date":"December 2012","text":" Shivers VIIFormats: Trade Paperback and Signed HardcoverFirst Edition Release Date:2013Edited By:Richard ChizmarSynopsis:Featuring \"Weeds\" and originally published in Cavalier Magazine in 1976 and again in Nugget Magazine in 1979, \"Weeds\" was also adapted into “The Lonesome Death of Jordy Verrill\" for the 80's cult classic Creepshow.More Information on Cemetery Dance ","image":"http://stephenking.com/images/anthology/shivers_VII/shivers_VII_prop_embed.jpg","id":339},{"title":"Shivers VI","date":"December 2009","text":" Shivers VIFormats: Trade PaperbackFirst Edition Release Date:2010Edited By:Richard ChizmarSynopsis:Includes stories from today's most popular authors of horror and suspense including Stephen King, Peter Straub, Al Sarrantonio, Jay Bonansinga, Lisa Tuttle, David B. Silva, Melanie Tem, Brian Hodge, Brian Keene, Alan Peter Ryan, Blake Crouch and Jack Kilborn, Bev Vincent, Brian James Freeman, Norman Prentiss, and many others.Contains the short story \"The Crate\". ","image":"http://stephenking.com/images/anthology/69/shivers_vi.jpg","id":340},{"title":"Shock Rock","date":"December 1990","text":" Shock RockFormats: PaperbackFirst Edition Release Date:1991Edited By:Jeff GelbSynopsis:Contains \"You Know They Got a Hell of a Band\" ","image":"http://stephenking.com/images/anthology/53/shock_rock.jpg","id":341},{"title":"Silence","date":"April 2004","text":" SilenceSynopsis: ","image":"http://stephenking.com/images/other_project/4/devils_wine.jpg","id":342},{"title":"Six Stories","date":"December 1996","text":" Six StoriesFormats: Formats: PaperbackFirst Edition Release Date: 1997Synopsis:Trade paperbackLimited edition of 900 numbered copies, signed by KingLimited edition of 200 roman numerated (I-CC) copies, signed by King, reserved for private distribution, not originally intended for sale10 presentation copies, signed by King28 proof copies, signed by KingIndeterminate number of unsigned copies with slight imperfections not suited for distribution through sale. ","image":"http://stephenking.com/images/books/six_stories/hardcover.jpg","id":343},{"title":"Skeleton Crew","date":"December 1984","text":" Skeleton CrewFormats: Formats: HardcoverFirst Edition Release Date: 1985Synopsis:Limited edition hardcover of 1,000 numbered copies, numbered in silver ink and signed by author and artist, with slipcase and laid-in print by the artist. This edition includes King's \"The Revelations of 'Becka Paulson\".Deluxe limited edition of 52 lettered (A-ZZ) copies, leather-bound with a zippered case. Also includes \"The Revelations of 'Becka Paulson\".25 unsigned Publisher's Copies, leather-bound with a zippered case7 Publishers Copies, leather-bound with a zippered case, signed by publisher, Jeff Conner; 6 copies unsigned.Presentation state of 17 copies, leather-bound with a zippered case, 8 of which were offered for sale.Single personal \"check copy\" of Jeff Conner, hand-bound in goatskin ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":344},{"title":"Skeleton Crew","date":"June 1985","text":" Skeleton CrewFormats: Hardcover / Paperback / Limited Edition / AudioFirst Edition Release Date:June, 1985Synopsis: ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":345},{"title":"Sleeping Beauties","date":"December 2016","text":" Sleeping BeautiesFormats: HardcoverFirst Edition Release Date:2017Synopsis: ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":346},{"title":"Sneakers","date":"October 1993","text":" SneakersSynopsis:Music exec John Tell doesn’t realize what he’s getting into when he begins working at Tabori Studios with famous producer Paul Jannings. When Tell notices an old pair of dirty sneakers in the studio’s bathroom day after day, his curiosity leads him to investigate their origins. What he finds leads him down a dark road of ghosts, drugs, and the realization that the famous Paul Janning may be a murderer. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":347},{"title":"Something to Tide You Over","date":"December 1999","text":" Something to Tide You OverSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":348},{"title":"Sometimes They Come Back","date":"December 1977","text":" Sometimes They Come BackSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":349},{"title":"Sorry, Right Number","date":"October 1993","text":" Sorry, Right NumberFormats: Not Available in PrintFirst Edition Release Date:October, 1993Synopsis:Notes:Included in Nightmares & Dreamscapes.Adapted for an episode of Tales from the Darkside, first aired November 22, 1987 (Season 4, Episode 9). ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":350},{"title":"Special Makeup Effects and the Writer","date":"December 1999","text":" Special Makeup Effects and the WriterSynopsis:non-fiction essay by King forGrande Illusions, subtitled A Learn by Example Guide to the Art and Technique of Special Makeup Effects from the Films of Tom Savini, published by Imagine, Inc., 1983 ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":351},{"title":"The Stand","date":"December 1977","text":" The StandFormats: Hardcover / PaperbackFirst Edition Release Date:1978Synopsis:One man escapes from a biological weapon facility after an accident, carrying with him the deadly virus known as Captain Tripps, a rapidly mutating flu that - in the ensuing weeks - wipes out most of the world's population. In the aftermath, survivors choose between following an elderly black woman to Boulder or the dark man, Randall Flagg, who has set up his command post in Las Vegas. The two factions prepare for a confrontation between the forces of good and evil.Notes:This edition is no longer in print following the 1990 publication ofThe Stand: The Complete & Uncut Edition ","image":"http://stephenking.com/images/books/78_stand/prop_embed.jpg","id":352},{"title":"The Stand: The Complete & Uncut Edition","date":"May 1990","text":" The Stand: The Complete & Uncut EditionFormats: Hardcover / Paperback / Limited Edition / TV Miniseries / DVDFirst Edition Release Date:May, 1990Synopsis:One man escapes from a biological weapon facility after an accident, carrying with him the deadly virus known as Captain Tripps, a rapidly mutating flu that - in the ensuing weeks - wipes out most of the world's population. In the aftermath, survivors choose between following an elderly black woman to Boulder or the dark man, Randall Flagg, who has set up his command post in Las Vegas. The two factions prepare for a confrontation between the forces of good and evil. ","image":"http://stephenking.com/images/books/stand/hardcover_prop_embed.jpg","id":353},{"title":"The Stand: The Complete and Uncut Edition","date":"December 1989","text":" The Stand: The Complete and Uncut EditionFormats: Formats: HardcoverFirst Edition Release Date: 1990Synopsis:Limited edition of 1,250 numbered copies, in a wooden box, signed by both author and artist.Limited edition of 52 lettered (A-ZZ) copies, in a wooden box, signed by both author and artist. Not originally intended for sale to the public. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":354},{"title":"Stationary Bike","date":"December 2002","text":" Stationary BikeSynopsis:After being told by his doctor that his cholesterol level is too high, Richard Sefkitz begins riding a stationary bike in the basement of his apartment building. To help alleviate the boredom, he buys maps and plots a route from New York to Herkimer, a town on the U.S./Canadian border, each day marking the amount of miles he has \"ridden\" towards his goal. He also paints a scene of a road on the blank wall in front of the bike to help him imagine actually traveling the road. As he nears Herkimer (according to the miles plotted on his map, at least) and has gotten in great shape physically, he begins having strange thoughts that there is someone following him on his daily rides. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":355},{"title":"Stephen King Goes to the Movies","date":"January 2009","text":" Stephen King Goes to the MoviesFormats: Trade PaperbackFirst Edition Release Date:January, 2009Synopsis:Coming Soon... ","image":"http://stephenking.com/images/new_in_stores/skgttm/skgttm_full.jpg","id":356},{"title":"Stephen King Goes to the Movies","date":"April 2009","text":" Stephen King Goes to the MoviesFormats: Formats: HardcoverFirst Edition Release Date: April, 2009Synopsis: ","image":"http://stephenking.com/images/limited_edition/45/sk_goes_to_movies_ltd.jpg","id":357},{"title":"Stephen King Q&A","date":"December 2001","text":" Stephen King Q&ASynopsis:Barnes & Noble Audio Q&A interview with Stephen regarding audio books and the Wavedancer benefit ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":358},{"title":"Storm of the Century","date":"February 1999","text":" Storm of the CenturyFormats: PaperbackFirst Edition Release Date:February, 1999Synopsis:The residents of Little Tall Island are in the worst blizzard any of them have ever had to deal with. Cut off from the rest of the world, they must also deal with an evil stranger who has murdered one of their elderly residents and even while being held prisoner continues to cause harm. In order to stop this, they are forced to make a choice which no one should have to make. Give him what he wants, and he will go away but what he wants is inconceivable. The consequences of their choice haunt their lives for years to come. ","image":"http://stephenking.com/images/screenplay/2/storm_of_the_century075.jpg","id":359},{"title":"Strange Maine","date":"December 1985","text":" Strange MaineFormats: PaperbackFirst Edition Release Date:1986Edited By:Waugh, Greenberg and McSherrySynopsis:Collection of short stories by various authors including King, Richard Matheson et al.Contains the short story  \"One for the Road\" ","image":"http://stephenking.com/images/anthology/54/strange_maine.jpg","id":360},{"title":"Strawberry Spring","date":"December 1977","text":" Strawberry SpringSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":361},{"title":"Suffer the Little Children","date":"December 1978","text":" Suffer the Little ChildrenSynopsis:An elderly teacher at the Summer Street School, Miss Sidley is disturbed when one of her students tells her that, “Tomorrow a bad thing will happen.” When she probes further into the matter, she discovers that aliens are slowly taking over the bodies of her students. Is her attempt to save them an amazing act of courage, or a fatal trick of the mind? ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":362},{"title":"Summer Thunder","date":"November 2015","text":" Summer ThunderSynopsis:Set in a post-apocalyptic world, the story details the final days of possibly the last two men on earth ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":363},{"title":"The Sun Dog","date":"September 1990","text":" The Sun DogSynopsis:A young boy receives a Polaroid camera for his birthday. There's something wrong with his gift, though. Every picture features a menacing dog that approaches the foreground in each subsequent photograph. ","image":"http://stephenking.com/images/books/four_past_midnight/hardcover_prop_embed.jpg","id":364},{"title":"Survivor Type","date":"December 1981","text":" Survivor TypeSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":365},{"title":"The Tale of Gray Dick","date":"December 1999","text":" The Tale of Gray DickSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":366},{"title":"Tales of Unknown Horror","date":"December 1977","text":" Tales of Unknown HorrorFormats: PaperbackFirst Edition Release Date:1978Edited By:Peter HainingSynopsis:Collection of short stories by various authors.Contains the short story \"The Cat from Hell\" ","image":"http://stephenking.com/images/anthology/56/tales_of_unknown_horror.jpg","id":367},{"title":"Tales of the Dead","date":"December 1979","text":" Tales of the DeadFormats: HardcoverFirst Edition Release Date:1980Edited By:Bill PronziniSynopsis:37 Chilling stories of voodoo, mummies and ghoulsContains the short story \"Gray Matter\" ","image":"http://stephenking.com/images/anthology/55/tales_of_the_dead.jpg","id":368},{"title":"The Talisman","date":"December 1983","text":" The TalismanFormats: Formats: HardcoverFirst Edition Release Date: 1984Synopsis:Deluxe limited edition of 1,200 numbered copies, with slipcase, signed by both authors.An unknown number of copies are designated \"Publisher's Copy\", \"Author's Copy\", and \"Artist's Presentation State\", signed by authors and illustratorsTrade hardcover edition of 1,200 copies, with slipcase, unsigned. ","image":"http://stephenking.com/images/limited_edition/11/talisman_limited_prop_embed.jpg","id":369},{"title":"The Talisman","date":"November 1984","text":" The TalismanFormats: Hardcover / Paperback / Limited Edition / Kindle / AudioFirst Edition Release Date:November, 1984Synopsis:Twelve-year-old Jack Sawyer embarks on an epic quest--a walk from the seacoast of New Hampshire to the California coast--to find the talisman that will save his dying mother's life. Jack's journey takes him into the Territories, a parallel medieval universe, where most people from his own universe have analogs called \"twinners.\" The queen of the Territories, Jack's mother's twinner, is also dying. ","image":"http://stephenking.com/images/books/talisman/hardcover_prop_embed.jpg","id":370},{"title":"The Ten O'Clock People","date":"October 1993","text":" The Ten O'Clock PeopleSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":371},{"title":"Terrors","date":"December 1981","text":" TerrorsFormats: PaperbackFirst Edition Release Date:1982Edited By:Charles L. GrantSynopsis:Contains \"Survivor Type\" ","image":"http://stephenking.com/images/anthology/57/terrors.jpg","id":372},{"title":"That Bus Is Another World","date":"November 2015","text":" That Bus Is Another WorldSynopsis:A man on his way to a potentially career-changing appointment witnesses something that causes a moral dilemma. Should he report what he's seen and risk missing his appointment or ignore it? ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":373},{"title":"That Feeling, You Can Only Say What It Is in French","date":"March 2002","text":" That Feeling, You Can Only Say What It Is in FrenchSynopsis:Presents the ultimate case of deja vu. ","image":"http://stephenking.com/images/books/everythings_eventual/hardcover_prop_embed.jpg","id":374},{"title":"They're Creeping Up on You","date":"December 1999","text":" They're Creeping Up on YouSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":375},{"title":"The Things They Left Behind","date":"November 2008","text":" The Things They Left BehindSynopsis:Scott Staley survived the collapse of the World Trade Center where he worked for Light and Bell Insurance. Nearly a year later, memorabilia his dead co-workers had kept in their office cubicles mysteriously appears in his apartment. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":376},{"title":"Thinner","date":"November 1984","text":" ThinnerFormats: HardcoverFirst Edition Release Date:November, 1984Synopsis:Billy Halleck commits vehicular homicide when his lack of attention to driving results in the death of an old lady on the street. Overweight Halleck is a lawyer with connections, though, and gets off with a slap on the wrist. After his trial, a gypsy curses him with a single word, \"Thinner.\" Halleck begins to lose weight uncontrollably and must pursue the band of gypsies who are responsible for his dwindling condition. ","image":"http://stephenking.com/images/books/thinner/hardcover_prop_embed.jpg","id":377},{"title":"Thrilling, Chilling Tales of Alien Encounters","date":"December 2004","text":" Thrilling, Chilling Tales of Alien EncountersFormats: PaperbackFirst Edition Release Date:2005Edited By:Gina HyamsSynopsis:Reprint of \"I Am the Doorway\" ","image":"http://stephenking.com/images/anthology/38/thrilling_chilling.jpg","id":378},{"title":"Throttle","date":"March 2009","text":" ThrottleSynopsis:A trucker is pitted against a tribe of motorcycle outlaws in the Nevada desert. ","image":"http://stephenking.com/images/anthology/36/he_is_legend007.jpg","id":379},{"title":"The Tommyknockers","date":"November 1987","text":" The TommyknockersFormats: Hardcover / Paperback / TV Miniseries / DVDFirst Edition Release Date:November, 1987Synopsis:Writer Bobbi Anderson becomes obsessed with digging up something she's found buried in the woods near her home. With the help of her friend, Jim Gardener, she uncovers an alien spaceship. Though exposure to the Tommyknockers who piloted the alien craft has detrimental effects on residents' health, the people of Haven develop a talent for creating innovative devices under its increasingly malignant influence. ","image":"http://stephenking.com/images/books/tommyknockers/hardcover_prop_embed.jpg","id":380},{"title":"Tommy","date":"November 2015","text":" TommySynopsis:An elegy for classmate \"Tommy\" and the Sixties. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":381},{"title":"Transgressions","date":"December 2004","text":" TransgressionsFormats: Hardcover / PaperbackFirst Edition Release Date:2005Edited By:Ed McBainSynopsis:Includes \"The Things They Left Behind\" ","image":"http://stephenking.com/images/anthology/35/transgressions_hc_.jpg","id":382},{"title":"Trucks","date":"December 1977","text":" TrucksSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":383},{"title":"Turn Down the Lights","date":"December 2013","text":" Turn Down the LightsFormats: Trade Hardcover / Special EditionsFirst Edition Release Date:December, 2013Edited By:Richard ChizmarSynopsis:\"Turn Down the Lights\" is a trade hardcover featuring Stephen's never before published short story \"Summer Thunder.\" This edition also celebrates the 25th anniversary of Cemetery Dance with extreme special editons to be published in 2014. For more information, see the Cemetery Dance website at the link below.More Information on CemeteryDance.com ","image":"http://stephenking.com/images/anthology/turn_down_the_lights/turn_down_the_lights_prop_embed.jpg","id":384},{"title":"Turning the Thumbscrews on the Reader","date":"December 1999","text":" Turning the Thumbscrews on the ReaderSynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":385},{"title":"Two Past Midnight: A Note on Secret Window, Secret Garden","date":"December 1999","text":" Two Past Midnight: A Note on Secret Window, Secret GardenSynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":386},{"title":"UR","date":"November 2015","text":" URSynopsis:Following a nasty break-up, lovelorn college English instructor Wesley Smith can't seem to get his ex-girlfriend's parting shot out of his head: \"Why can't you just read off the computer like the rest of us?\" Egged on by her question and piqued by a student's suggestion, Wesley places an order for Amazon.com's Kindle eReader. The [pink?] device that arrives in a box stamped with the smile logo – via one-day delivery that he hadn't requested – unlocks a literary world that even the most avid of book lovers could never imagine. ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":387},{"title":"Umney's Last Case","date":"October 1993","text":" Umney's Last CaseSynopsis:It’s just another ordinary day in 1930s Los Angeles for private investigator Clyde Umney, until a new client walks into his office. Umney soon learns that his client is the crime-fiction writer who not only created him, but now needs to switch places with him. An unknown power forces Umney to take on the writer’s identity in the year 1994. Now, Clyde needs to figure out how to get back to his own universe and then take revenge on his creator. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":388},{"title":"Uncle Otto's Truck","date":"June 1985","text":" Uncle Otto's TruckSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":389},{"title":"Under the Dome","date":"November 2009","text":" Under the DomeFormats: Hardcover / Paperback / AudiobookFirst Edition Release Date:November, 2009Synopsis:On an entirely normal, beautiful fall day in Chester’s Mill, Maine, the town is inexplicably and suddenly sealed off from the rest of the world by an invisible force field. Planes crash into it and fall from the sky in flaming wreckage, a gardener’s hand is severed as “the dome” comes down on it, people running errands in the neighboring town are divided from their families, and cars explode on impact. No one can fathom what this barrier is, where it came from, and when—or if—it will go away.Dale Barbara, Iraq vet and now a short-order cook, finds himself teamed with a few intrepid citizens—town newspaper owner Julia Shumway, a physician’s assistant at the hospital, a selectwoman, and three brave kids. Against them stands Big Jim Rennie, a politician who will stop at nothing—even murder—to hold the reins of power, and his son, who is keeping a horrible secret in a dark pantry. But their main adversary is the Dome itself. Because time isn’t just short. It’s running out.Notes:Click here for the high resolution Under the Dome Jacket ArtworkClick here for the Under the Dome Flash Widget and Countdown TimerUnder the Dome is now available in paperback as two volumes,Under The Dome Part I and Under The Dome Part II. ","image":"http://stephenking.com/images/novel/56/utd.jpg","id":390},{"title":"Under the Weather","date":"November 2015","text":" Under the WeatherSynopsis: ","image":"http://stephenking.com/images/books/bazaar-of-bad-dreams/bobd_cover_1_prop_embed.jpg","id":391},{"title":"Vermont Library Conference/VEMA Annual Meeting: The Bogeyboys","date":"December 1999","text":" Vermont Library Conference/VEMA Annual Meeting: The BogeyboysSynopsis:When I speak in public, a thing I do as rarely as possible, I usually don't speak from a prepared text and I hardly ever try to say anything serious; to misquote Mark Twain, I feel that anyone looking for a moral should be hung and anyone looking for a plot should be shot. Today, though, I want to talk about something very serious indeed: adolescent violence in American schools. This outbreak has become so serious that a bus driver from Conyers, Georgia, interviewed last week on the CBS Evening News, suggested that the slang term “going postal” may soon be changed to “going pupil.” I suggest that a great many parts of American society have contributed to creating this problem, and that we must all work together to alleviate it...and I use the word “alleviate” rather than “cure” because I don't think any cure, at least in the sense of a quick fix--that is what Americans usually mean by cure; fast-fast-fast relief, as the aspirin commercials used to say-I don't think that sort of cure is possible. This is a violent society. Law enforcement statistics suggest it may not be as violent now as it was fifteen years ago, but it's really too early to tell; we may only be witnessing a blip on the graph.America was born in the violence of the Boston Massacre, indemnified in the violence of Bull Run, Gettysburg, and Shiloh Church, shamed by the violence of the Indian Wars, reaffirmed by the violence of two world wars, a police action in Korea, and the conflict in Vietnam. Most of the guns carried in those armed actions were carried by boys about the age of the Littleton killers and not much older than Thomas Solomon, the Conyers, Georgia, shooter. These wars-as well as the Star Wars of the future-can be fought at the local mall's video arcade for fifty cents a pop.History aside, we suffer from road rage, fear home invasion, and enjoy watching Jerry Springer's guests mix it up on afternoon TV. Once the burglar alarm is set, that is. We like guns, and too many unstable folks have access to them. Some, we are learning, aren't even old enough to shave yet. It is these young killers-- these young guns, to use the title of a popular movie of about twelve years ago--who trouble us. And they trouble us a lot. Hundreds of kids kill themselves on America's highways each month, but even when a large number of them die together, it rarely makes national news. We understand the underlying causes, you see--usually these boil down to the same lethal mix: inexperience, alcohol, and that adolescent belief, both endearing and terrifying, that God put them on earth to live forever. When the deaths come as a result of gunfire and explosions, we either don't understand or tell ourselves we don't. Our fear spawns a creature with no face, one I know very well: it's the bogeyman. When kids die on the highway, it's sad but not nationwide news. When the bogeyman strikes, however...that's different. Then everyone, even the politicians, take notice.Eric Harris and Dylan Klebold were eighteen and seventeen respectively when they blew their dangerous, unhappy brains out, neither one old enough to buy a legal sixpack, or rent a car, or get more than simple liability coverage on an automobile of his own. Not old enough to be bogeymen, in other words, but they are genuine frighteners, all the same. They have closed schools in many states and caused massive absenteeism in others, where not even an outright threat of violence is now needed to unsettle children, teachers, and parents; vague rumors (“a guy I know heard about a guy who's got a gun...”) or an anonymous e- mail is enough.As the most recent incident in Georgia so clearly illustrates, Harris and Klebold will continue to participate in the American educational process between now and the end of the school year. Harris and Klebold, too young to be bogeymen; call them bogeyboys, if you like. I think that fits them very well.That I feel pity for these bogeyboys should surprise no one; I have been drawn again and again to stories of the powerless and disenfranchised young, and have written three novels about teenagers driven to murder: Carrie (1974), Rage (published in 1977 under the pseudonym Richard Bachman), and Apt Pupil (1982). In Carrie, a girl who is ceaselessly tormented by her classmates murders most of them at the senior prom after one final, gruesome trick pushes her over the edge. In a sense she was the original riot girl. In Rage, a boy named Charlie Decker brings a gun to school, kills a teacher with it, then holds his algebra class hostage until the police end the siege by shooting him.In Apt Pupil, a boy named Todd Bowden discovers a Nazi war criminal living on his block and brings the old man back to a dangerous vitality. On the surface, Todd is the perfect California high school kid. Beneath, he's fascinated by the Holocaust and the power wielded by the Nazis; a member of the Trenchcoat Mafia, in fact, without the trenchcoat. After a long (and increasingly psychotic) dance with his pet Nazi, Todd is found out. His response, not shown in the movie which played theaters briefly last year, is to take a high-powered rifle to a nearby freeway, where he shoots at anyone who moves until he is killed. His death is, in fact, what police now sometimes call “blue suicide.”I sympathize with the losers of the world and to some degree understand the blind hormonal rage and ratlike panic which sets in as one senses the corridor of choice growing ever narrower, until violence seems like the only possible response to the pain. And although I pity the Columbine shooters, had I been in a position to do so, I like to think I would have killed them myself, if that had been the only choice, put them down the way one puts down any savage animal that cannot stop biting. There comes a point at which the Harrises and the Klebolds become unsalvageable, when they pass through some phantom tollbooth and into a land where every violent impulse is let free. At this point, the societal issues cease to matter and there is only the job of saving as many people as possible from what seems to me to be actual evil, in the Old Testament sense of that word. Although the pundits, politicians, and psychologists hesitate at the word- -I hesitate at it myself--nothing else seems to fit the sweep of these acts and the wreckage left behind. And in the presence of evil, any pity or sympathy we feel must be put aside and saved for the victims.This point of no return can almost always be avoided before the shooting and killing begins, and it usually is. Violence on the level of that committed at Columbine High School is still rare in American society, although it may well now become more common; there is a powerful reverb unit hooked up to the already- amplified teenage culture-politic. In that amp-cult, things like huffing, tattooing, and body-piercing spread almost at the speed of e-mail; the lure of the gun may spread in much the same way. And the guns are out there. As I said in The Stand, at some tiresome length, all that stuff is out there, just lying around and waiting for the wrong person to pick it up.To some degree, what happened at Columbine happened because of what happened in Jonesboro, Arkansas (five murdered), Paducah, Kentucky (three murdered), and Springfield, Oregon (four murdered, two parents and two kids at a school dance). Similarly, the shootings and rumors of shootings in the weeks and months ahead will happen because of Harris and Klebold and Columbine High; because of T.J. Solomon and Heritage High. It's an amp-cult thing. Harris & Klebold may be dead, but they're going to be mighty lively for awhile. Believe me on this. I know a good deal about spooks, and more than I want to about boys who play with guns.In the wake of the shootings, film and TV and book people have pointed the finger at the gun industry and at that ever-popular bogeyman, the NRA. The gun people point right back, saying that America's entertainment industry has created a culture of violence. And, behind it all, we are bombing the living hell out of Yugoslavia, because that's the way we traditionally solve our problems when those pesky foreign leaders won't do what we think is right. So who is really to blame? My answer is all of the above. And I speak from some personal experience and a lot of soul-searching.I can't say for sure that Michael Carneal, the boy from Kentucky who shot three of his classmates dead as they prayed before school, had read my novel, Rage, but news stories following the incident reported that a copy of it had been found in his locker. It seems likely to me that he did. Rage had been mentioned in at least one other school shooting, and in the wake of that one an FBI agent asked if he could interview me on the subject, with an eye to setting up a computer profile that would help identify potentially dangerous adolescents. The Carneal incident was enough for me. I asked my publisher to take the damned thing out of print. They concurred. Are there still copies of Rage available? Yes, of course, some in libraries where you ladies and gentlemen ply your trade. Because, like the guns and the explosives and the Ninja throwing-stars you can buy over the Internet, all that stuff is just lying around and waiting for someone to pick it up.Do I think that Rage may have provoked Carneal, or any other badly adjusted young person, to resort to the gun? It's an important question, because it goes to the very heart of the wrangle over who's to blame. You might as well ask if I believe that the mere presence of a gun makes some people want to use that gun. The answer is troubling, but it needs to be faced: in some cases, yes. Probably it does. Often? No, I don't believe so. How often is too often? That's not for me or any other single person to say. It's a question each part of our society must answer for itself, as each state, for instance, must answer the question of when a kid is old enough to have a driver's license or buy a drink.There are factors in the Carneal case which make it doubtful that Rage was the defining factor, but I fully recognize that it is in my own self-interest to feel just that way; that I am prejudiced in my own behalf. I also recognize the fact that a novel such as Rage may act as an accelerant on a troubled mind; one cannot divorce the presence of my book in that kid's locker from what he did any more than one can divorce the gruesome sex-murders committed by Ted Bundy from his extensive collection of bondage-oriented porno magazines. To argue free speech in the face of such an obvious linkage (or to suggest that others may obtain a catharsis from such material which allows them to be atrocious only in their fantasies) seems to me immoral. That such stories, video games (Harris was fond of a violent computer-shootout game called Doom), or photographic scenarios will exist no matter what--that they will be obtainable under the counter if not over it--begs the question. The point is that I don't want to be a part of it. Once I knew what had happened, I pulled the ejection-seat lever on that particular piece of work. I withdrew Rage, and I did it with relief rather than regret.If, on the other hand, you were to ask me if the presence of potentially unstable or homicidal persons makes it immoral to write a novel or make a movie in which violence plays a part, I would say absolutely not. In most cases, I have no patience with such reasoning. I reject it as both bad thinking and bad morals. Like it or not, violence is a part of life and a unique part of American life. If accused of being part of the problem, my response is the time-honored reporter's answer: “Hey, many, I don't make the news, I just report it.”I write fantasies, but draw from the world I see. If that sometimes hurts, it's because the truth usually does. John Steinbeck was accused of gratuitous ugliness when he wrote about the migration of the Okies to California in The Grapes of Wrath, even of trying to foment a domestic revolution, but most of his accusers--like those who made similar accusations against Upton Sinclair when he wrote about the corrupt putrescence of the meat-packing industry in The Jungle--were people who preferred fairy-tales and happily-ever-afters. Sometimes the truth of how we live is just ugly, that's all. But to turn aside from these truths out of some perceived delicacy, or to give in to the idea that writing about violence causes violence, is to embrace hypocrisy. In Washington, hypocrisy breeds politicians. In the arts, it breeds pornography.My stories of adolescent violence were all drawn, in some degree, from my own memories of high school. That particular truth, as I recalled it when writing as an adult, was unpleasant enough. I remember high school as a time of misery and resentment. In Iroquois trials of manhood, naked warriors were sent running down a gauntlet of braves swinging clubs and jabbing with the butt ends of spears. In high school the goal is Graduation Day instead of a manhood feather, and the weapons are replaced by insults, slights, and epithets, many of them racial, but I imagine the feelings are about the same. The victims aren't always naked, and yet a good deal of the rawest hazing does take place on playing fields and in locker rooms, where the marks are thinly dressed or not dressed at all. The locker room is where Carrie starts, with girls throwing sanitary napkins at a sexually ignorant girl who thinks she is bleeding to death.I don't trust people who look back on high school with fondness; too many of them were part of the overclass, those who were taunters instead of tauntees. These are the ones least likely to understand the bogeyboys and to reject any sympathy for them (which is not the same as condoning their acts, a point which should not have to be made but which probably does). They are also the ones most likely to suggest that books such as Carrie and The Catcher in the RyeA Separate Peace be removed from libraries. I submit to you that these people have less interest in reducing the atmosphere of violence in schools than they may have in forgetting how badly some people--they themselves, in some cases--may have behaved while there. andAnd still...for a' that and a' that, as Robert Burns says, the amp-cult atmosphere of make-believe violence in which so many children now live has to be considered part of the problem. We may like our Jackie Chan movies, Walker Texas Ranger on TV, and the ultra-violent survivalist paperback novels--not to mention the pseudo-religious novels in which the Tribulation Days promised in the Book of Revelations are depicted in gory detail--but we need to recognize that these things are hurting us, just as so many of us had to recognize that our cigarettes were hurting us, much as we enjoyed them.Yet there are other touchstones of the bogeyboy environment, and many of them have little to do with books or films. Bogeyboys are profoundly out of touch with their parents, and their parents are likewise out of touch with them. They gravitate toward groups run by adults and along quasi-military lines: scouting groups, karate and martial arts clubs, military and paramilitary groups, collector-clubs. The biggest exception has to do with sports. Bogeyboys rarely win school letters...except of course, if the school they attend happens to have a rifle-shooting team.Bogeyboys come from families where the other sibs have been singled out for recognition in sports activities, academics, performing arts, church, or community service programs. Parents or other close relatives are often career military personnel. Bogeyboys do not win foot-races, get kissed by the Homecoming Queen, or garner blue ribbons. They are profoundly inarticulate and don't date much (Eric Harris was turned down when he asked a girl to go to the prom with him). At home, they stay in their rooms. If pressed, the parents of bogeyboys will often admit that they were afraid of these children long before they broke out and committed their acts of violence. If they add that they can't say exactly why they were afraid, no one need be surprised; these parents, often bright, nonabusive, and community-active, are rarely skilled at communication within the family. One wishes such families would read together, let some writer who is reasonably articulate do their talking for them, but of course this rarely happens.Bogeyboys make few friends, and those they do make are often as crazy and balefully confused as they are. Their mutual attraction, sometimes homoerotic, has its own amp-cult effect as the friends begin to harmonize their lives, duplicating each others' favorite clothes, records, movies, video games, and Internet chat-rooms. (Books, violent or otherwise, are rarely a bright color in the Bogeyboy entertainment spectrum.) These cultural touchstones, from Metallica (“Exit light/enter night,” is how the chorus to one song begins) and Marilyn Manson to films such as Scream, create a language for those who cannot speak otherwise. For awhile it may suffice; it may suffice long enough, even, for something to change before terrible, irrevocable acts are committed. In some cases, however, the pressure becomes too great. Unable to internalize their feelings of anger and inadequacy, unable to externalize them by talking freely to anyone, the boiler finally ruptures and the steam shoots out sideways. Anyone in the way gets scalded. In Colorado, twelve of them were scalded to death.Bogeyboys, it goes without saying, also always have access to guns. But in America, doesn't everyone, when you get right down to it? Isn't it fair to say that in America, one of the great religions is The Holy Church of the Nine-Millimeter? The gun people don't like to hear it, but I think it has to be said. And if we in the arts are willing to own up to the blood on our hands, I think they need to own up to the blood on theirs.But I repeat that it is useless at this point to get into the whole bad-culture versus gun-availability argument; it has degenerated to the point where one almost expects to see bumper stickers reading GUNS DON'T KILL PEOPLE, AC/DC CDS KILL PEOPLE. And in any case, both camps are operating not out of any real thought but out of two powerful fears. The first is that theydeserve to be blamed. The second is more primal, and that is the fear of ghosts. Bogeyboys, drifting through the hallways of Everyhigh, U.S.A., whispering to the disenfranchised and the spat-upon that there is a way to even things up, that there is a lot of potent get-even medicine in a Tec-9 or a pipe bomb. will be blamed...and that they willMay I be blunt? This fear is that the violence isn't ending but only beginning. It isn't completely rational, but I think I also understand that irrational fears are often the most powerful of all. In this case, the unstated idea is that we have lived well while most of the world lives badly, eaten well while too much of the world goes hungry or actually starves, dressed our children in the best, much of it made by children in other countries who have little but their dreams, many of which are the violent American dreams they see on TV. We have had all this, some of us--maybe a lot of us--seem to think, and there must be a price. There must be a payment. Perhaps there must even be a judgment. Then into our uneasy minds come the images of the bogeyboys, who shot so well because they had trained on their home computers, and on the video games down at the mall.President Clinton has made a few feeble swipes at addressing this issue, but one can only gape at the unintentionally comic spectacle of this man chastising the gun-lobby and America's love of violent movies while he rains bombs on Yugoslavia, where at least twenty noncombatants have already died for every innocent student at Columbine High. It is like listening to a man with a crack-pipe in his hand lecture children about the evils of drugs.There are solutions, and there is also a calming sense of perspective that needs to be brought into play. The perspective begins with realizing that most kids in school are not bogeyboys but plain old good kids, interested in getting educations and having pleasant social lives, not necessarily in that order. The long-term solutions lie where they always have, in family lives which emphasize love, communication, and a knowledge of what the kids are up towho they're seeing, what they're saying, and what they may be using to get high on come the weekend.One immediate solution, or a step toward it, lies in the guidance offices of American high schools, where a better, stronger effort has to be made to identify potential Eric Harrises, Dylan Klebolds, and Thomas Solomons; there needs to be a quantum shift of emphasis from job guidance to psychological guidance (although sometimes they are the same). When such guidance is rejected, there needs to be a process to remove potentially violent children from school environments. The ACLU won't like it, but I don't imagine such Columbine High students as John Tomlin and Rachel Scott much like being dead instead of at the Senior Prom. And if we are going to restrict the right of liberal Constitution-watchers to get innocent kids killed, we need to restrict the right of the gun lobby to get them killed, as well; this country needs to restrict the sale of handguns much more strictly than it has up to now been willing to do. Background checks at gunshows is only a first step.And yes, there needs to be a re-examination of America's violent culture of the imagination. It needs to be done soberly and calmly; a witch-hunt won't help. Never mind burning Marilyn Manson's records in great fundamentalist bonfires or removing Anne Rice novels from the local library because they might give a few unempowered dweebs the idea of donning Goth clothing and powdering their faces white; let's go beyond the question of whether or not the next crop of natural born killers are currently honing their skills in Arcade 2000 at the local mall. It's time for an examination of why Americans of all ages are so drawn to armed conflict (Rambo), unarmed conflict (World Federation Wrestling), and images of violence. These things are not just speaking to potential teenage killers, but to a great many of us. Their hold on the national psyche has progressed to a point where the Columbine murders dominate our headlines and possess our thoughts to the exclusion of much else, including the mass exodus of a million Kosovars and the world's most dangerous armed conflict since Vietnam.Harris and Klebold are dead and in their graves, but we are in terror of them all the same; they are the Red Death in our richly appointed castle (where, as the twenty-first century approaches and the stock market daily bops its way to new highs, the party has never been more feverishly gay). They are our bogeyboys, and perhaps the real first step in making them go away is to decide what it is about them that frightens us so much. It is a discussion which must begin in families, schools, libraries, and in public forums such as this. Which is why I have begged your attention and yourindulgence on such an unappetizing subject.Thank you. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":392},{"title":"The Very Best of Best New Horror","date":"December 2009","text":" The Very Best of Best New HorrorFormats: HardcoverFirst Edition Release Date:2010Edited By:Stephen JonesSynopsis:For twenty yearsThe Mammoth Book of Best New Horrorhas been recognized as the world's foremost annual showcase of horror and dark fantasy fiction. Now, with one story from each year in which it has been published, from 1989 to 2008, representing the work of dozens of authors, many of them acknowledged as the foremost practitioners of the genre, multi-award-winning editor Stephen Jones looks back on two decades of superb writing to bring readers the ultimate horror fiction anthology.Contains the short story \"The New York Times at Special Bargain Rates\". ","image":"http://stephenking.com/images/anthology/67/the_very_best_of_new_horror.jpg","id":393},{"title":"The Weapon","date":"December 1999","text":" The WeaponSynopsis:Stephen's thoughts about 9/11 published in The New York Times Magazine ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":394},{"title":"The Wedding Gig","date":"June 1985","text":" The Wedding GigSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":395},{"title":"Weeds","date":"December 2014","text":" WeedsSynopsis:When a meteorite lands on his property, Jordy Verrill envisions an easy payday. Unfortunately for Jordy, this is no ordinary rock—and the uncompromising force inside has found its first target. ","image":"http://stephenking.com/images/anthology/77/darkscreamsvol01.jpg","id":396},{"title":"The Weird","date":"December 2010","text":" The WeirdFormats: Trade paperback / EbookFirst Edition Release Date:2011Edited By:Ann & Jeff VandermeerSynopsis:From Lovecraft to Borges to Gaiman, a century of intrepid literary experimentation has created a corpus of dark and strange stories that transcend all known genre boundaries. Together these stories form The Weird and amongst its practitioners number some of the greatest names in twentieth and twenty-first century literature. Exotic and esoteric, The Weird plunges you into dark domains and brings you face to face with surreal monstrosities; you won t find any elves or wizards here.but you will find the boldest and downright most peculiar stories from the last hundred years bound together in the biggest Weird collection ever assembled. The Weird features an all star cast of authors, from classics to international bestsellers to Booker prize winners. Here are Ben Okri and George R.R. Martin, Angela Carter and Kelly Link, Franz Kafka and China Mieville, Clive Barker and Haruki Murakami, M.R. James and Neil Gaiman, Mervyn Peake and Michael Chabon, Stephen King and Daphne Du Maurier.Contains the short story \"The Man in the Black Suit\". ","image":"http://stephenking.com/images/anthology/65/the_weird.jpg","id":397},{"title":"What Stephen King Does for Love","date":"December 1999","text":" What Stephen King Does for LoveSynopsis: ","image":"http://stephenking.com/images/books/secret_windows/hardcover_prop_embed.jpg","id":398},{"title":"What's Scary","date":"December 1999","text":" What's ScarySynopsis:“What’s Scary” critiques the last decade of genre cinema, from 1999’s phenomenon THE BLAIR WITCH PROJECT to 2009’s surprise smash DISTRICT 9. He also chooses his favorite films and touches on the recent flood of horror remakes and zombie flicks. ","image":"http://stephenking.com/images/books/no_image_available/n_i_a.jpg","id":399},{"title":"Why We're in Vietnam","date":"September 1999","text":" Why We're in VietnamSynopsis:It's 1999 and we are reunited with John \"Sully\" Sullivan from \"Low Men in Yellow Coats\" who is remembering events and people from his past as he attends the funeral of one of his comrades from his troop in Vietnam. ","image":"http://stephenking.com/images/books/hearts_in_atlantis/hardcover_prop_embed.jpg","id":400},{"title":"Willa","date":"November 2008","text":" WillaSynopsis:A group of travelers has found themselves stranded in a railroad station waiting for a train that never seems to come to replace the one they had been traveling in.   David Sanderson realizes that his fiance, Willa, is not at the station and follows her to the nearby town.  He finds her at a local honky-tonk but when it seems that the other patrons of the establishment are not just ignoring them, an awareness of their situation begins to come over him. ","image":"http://stephenking.com/images/story_collection/8/just_after_sunset.jpg","id":401},{"title":"Woman - An Anthology","date":"October 2014","text":" Woman - An AnthologyFormats: HardcoverFirst Edition Release Date:October, 2014Edited By:Alana BrookerSynopsis:The collection Woman - An Anthology features selections on the theme of women in literature and includes writing from incredibly diverse and acclaimed authors.Rather than focusing specifically on female protagonists, this anthology considers the range of the female voice as part of an introspective and nuanced compilation. These collected works explore how women are written and the perspectives from which they are written.A cross-section from multiple genres and styles, the stories herein are weaved together to form a varied literary tapestry.Contains the short story \"Willa\". ","image":"http://stephenking.com/images/anthology/78/womancover.jpg","id":402},{"title":"The Woman in the Room","date":"December 1977","text":" The Woman in the RoomSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightshift/hardcover_prop_embed.jpg","id":403},{"title":"Word Processor of the Gods","date":"June 1985","text":" Word Processor of the GodsSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/skeleton_crew/hardcover_prop_embed.jpg","id":404},{"title":"Year's Best Fantasy & Horror","date":"December 1994","text":" Year's Best Fantasy & HorrorFormats: PaperbackFirst Edition Release Date:1995Edited By:Ellen Datlow & Terri WindlingSynopsis:Contains \"The Man in the Black Suit\" ","image":"http://stephenking.com/images/anthology/60/years_best_fantasy__horror.jpg","id":405},{"title":"Year's Best Horror Stories - Series IX","date":"December 1980","text":" Year's Best Horror Stories - Series IXFormats: PaperbackFirst Edition Release Date:1981Edited By:Karl WagnerSynopsis:Contains \"The Monkey\" ","image":"http://stephenking.com/images/anthology/59/years_best_horror_ix.jpg","id":406},{"title":"You Know They Got a Hell of a Band","date":"December 1990","text":" You Know They Got a Hell of a BandSynopsis:A synopsis for this story is not currently available. ","image":"http://stephenking.com/images/books/nightmares_and_dreamscapes/hardcover_prop_embed.jpg","id":407},{"title":"Zombies! Zombies! Zombies!","date":"December 2010","text":" Zombies! Zombies! Zombies!Formats: Trade PaperbackFirst Edition Release Date:2011Edited By:Otto PenzlerSynopsis:Zombies! Zombies! Zombies!is the darkest, the living-deadliest, scariest--and dare we say most tasteful--collection of zombie stories ever assembled. It’s so good, it's a no-brainer. There is never a dull moment in the world of zombies. They are superstars of horror and they are everywhere, storming the world of print and visual media. Their endless march will never be stopped. It's the Zombie Zeitgeist! Now, with his wide sweep of knowledge and keen eye for great storytelling, Otto Penzler offers a remarkable catalog of zombie literature. Including unstoppable tales from world-renowned authors like Stephen King, Joe R. Lansdale, Robert McCammon, Robert E. Howard, and Richard Matheson to the writer who started it all, W.B. Seabrook,Zombies! Zombies! Zombies!will delight and devour horror fans from coast to coast.Contains the short story \"Home Delivery\". ","image":"http://stephenking.com/images/anthology/68/zombies.jpg","id":408}]}